{"id":"d644e150-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.824Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.913Z","created_by":"admin","name":"[GD] Microsoft Build Engine Using an Alternate Name","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"An instance of MSBuild, the Microsoft Build Engine, was started after being renamed. This is uncommon behavior and may indicate an attempt to run unnoticed or undetected.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["The Build Engine is commonly used by Windows developers but use by non-engineers is unusual."],"from":"now-540s","rule_id":"7258da78-925f-461e-8e57-30455246cd15","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1036/","name":"Masquerading","subtechnique":[],"id":"T1036"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.pe.original_file_name:MSBuild.exe and not process.name: MSBuild.exe","filters":[],"throttle":"no_actions","actions":[]}
