{"id":"d82f4c30-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.420Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.950Z","created_by":"admin","name":"[GD] High Number of Okta User Password Reset or Unlock Attempts","tags":["Continuous Monitoring","Elastic","Identity","Identity and Access","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Identifies a high number of Okta user password reset or account unlock attempts. An adversary may attempt to obtain unauthorized access to an Okta user account using these methods and attempt to blend in with normal activity in their target's environment and evade detection.","risk_score":47,"severity":"medium","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"55m","kibana_siem_app_url":"https://cbbf317cf62e4dd9b9913c1cc96ca394.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"author":["Elastic"],"false_positives":["The number of Okta user password reset or account unlock attempts will likely vary between organizations. To fit this rule to their organization, users can duplicate this rule and edit the schedule and threshold values in the new rule."],"from":"now-3600s","rule_id":"cbb9346e-7bb3-4623-a816-43b67047305e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1078/","name":"Valid Accounts","subtechnique":[],"id":"T1078"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1078/","name":"Valid Accounts","subtechnique":[],"id":"T1078"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1078/","name":"Valid Accounts","subtechnique":[],"id":"T1078"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001/","name":"Initial Access","id":"TA0001"}}],"to":"now","references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":5,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:(system.email.account_unlock.sent_message or system.email.password_reset.sent_message or system.sms.send_account_unlock_message or system.sms.send_password_reset_message or system.voice.send_account_unlock_call or system.voice.send_password_reset_call or user.account.unlock_token)","filters":[],"threshold":{"field":["okta.actor.id"],"value":5,"cardinality":[]},"throttle":"no_actions","actions":[]}
