{"id":"d6492710-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.125Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.928Z","created_by":"admin","name":"[GD] Microsoft Build Engine Loading Windows Credential Libraries","tags":["Credential Access","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"An instance of MSBuild, the Microsoft Build Engine, loaded DLLs (dynamically linked libraries) responsible for Windows credential management. This technique is sometimes used for credential dumping.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["The Build Engine is commonly used by Windows developers but use by non-engineers is unusual."],"from":"now-540s","rule_id":"86cc5e11-88f4-486d-bac8-e7b25152df47","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1003/","name":"OS Credential Dumping","subtechnique":[],"id":"T1003"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}}],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:change and (process.pe.original_file_name:(vaultcli.dll or SAMLib.DLL) or dll.name:(vaultcli.dll or SAMLib.DLL)) and process.name: MSBuild.exe","filters":[],"throttle":"no_actions","actions":[]}
