{"id":"d832cea1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.417Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.951Z","created_by":"admin","name":"[GD] Threat Detected by Okta ThreatInsight","tags":["Continuous Monitoring","Elastic","Identity","Monitoring","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Detects when Okta ThreatInsight identifies a request from a malicious IP address. Investigating requests from IP addresses identified as malicious by Okta ThreatInsight can help security teams monitor for and respond to credential based attacks against their organization, such as brute force and password spraying attacks.","risk_score":47,"severity":"medium","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-360s","rule_id":"728ca0c1-2d1d-47e4-b583-d4f7a165907d","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":7,"exceptions_list":[{"list_id":"783fe305-0c70-4cda-911a-05ad8b80a019","namespace_type":"single","id":"974f89e0-bdb3-11eb-9011-836fc96f7351","type":"detection"}],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:security.threat.detected","filters":[],"throttle":"no_actions","actions":[]}
