{"id":"d3d9fbd1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:47.280Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.912Z","created_by":"admin","name":"[GD] Searching for Saved Credentials via VaultCmd","tags":["Credential Access","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Windows Credential Manager allows you to create, view, or delete saved credentials for signing into websites, connected applications, and networks. An adversary may abuse this to list or dump credentials stored in the Credential Manager for saved usernames and passwords. This may also be performed in preparation of lateral movement.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"602cdcb8-2e5e-4be5-9f2e-77871c682572","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1003/","name":"OS Credential Dumping","subtechnique":[],"id":"T1003"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}}],"to":"now","references":["https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16","https://rastamouse.me/blog/rdp-jump-boxes/"],"version":2,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  (process.pe.original_file_name:\"vaultcmd.exe\" or process.name:\"vaultcmd.exe\") and\n  process.args:\"/list*\"\n","filters":[],"throttle":"no_actions","actions":[]}
