{"id":"d1b19d90-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:30.307Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.872Z","created_by":"admin","name":"[GD] Microsoft Build Engine Started by a System Process","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"An instance of MSBuild, the Microsoft Build Engine, was started by Explorer or the WMI (Windows Management Instrumentation) subsystem. This behavior is unusual and is sometimes used by malicious payloads.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["The Build Engine is commonly used by Windows developers but use by non-engineers is unusual."],"from":"now-540s","rule_id":"5aa87c72-39cf-40d3-ab6e-4662840734e3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1127/","name":"Trusted Developer Utilities Proxy Execution","subtechnique":[],"id":"T1127"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}},{"framework":"MITRE ATT&CK","technique":[],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002/","name":"Execution","id":"TA0002"}}],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.name:MSBuild.exe and process.parent.name:(explorer.exe or wmiprvse.exe)","filters":[],"throttle":"no_actions","actions":[]}
