{"id":"af172000-4ba8-11ec-9fcb-3bc48f034fff","updated_at":"2022-02-28T19:49:04.951Z","updated_by":"admin","created_at":"2021-11-22T15:27:21.506Z","created_by":"admin","name":"[GD] Carbon Black File Unauthorized Run","tags":["GD"],"interval":"24h","enabled":false,"description":"When a file is accessecd on a system without the users explicit permissions","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"24h","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-172800s","rule_id":"606eea46-0eb2-4285-835b-ed3bc587535c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:onprem-*","*:windows*","*:aws-syslog*"],"query":"(aws.fluent_tags: \"CARBONBLACK\"  and (rule.description: \"New unapproved file to computer\" or rule.description: \"Execution block \\(unapproved file\\)\" or rule.description: \"Process demoted\")) or (winlog.event_id: \"4688\" or winlog.event_id: \"4663\" )","filters":[],"throttle":"no_actions","actions":[]}
