{"id":"d1b59530-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:34.014Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.892Z","created_by":"admin","name":"[GD] Process Injection by the Microsoft Build Engine","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"An instance of MSBuild, the Microsoft Build Engine, created a thread in another process. This technique is sometimes used to evade detection or elevate privileges.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["The Build Engine is commonly used by Windows developers but use by non-engineers is unusual."],"from":"now-360s","rule_id":"fbee04bb-e050-438f-b162-4f44a4db29a7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1055/","name":"Process Injection","subtechnique":[],"id":"T1055"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1055/","name":"Process Injection","subtechnique":[],"id":"T1055"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0004/","name":"Privilege Escalation","id":"TA0004"}}],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"process.name:MSBuild.exe and event.action:\"CreateRemoteThread detected (rule: CreateRemoteThread)\"","filters":[],"throttle":"no_actions","actions":[]}
