{"id":"d64ad4c0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.331Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.926Z","created_by":"admin","name":"[GD] AWS RDS Instance-Cluster Stoppage","tags":["Asset Visibility","AWS","Cloud","Continuous Monitoring","Elastic","SecOps"],"interval":"10m","enabled":false,"description":"Identifies that an Amazon Relational Database Service (RDS) cluster or instance has been stopped.","risk_score":47,"severity":"medium","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Valid clusters or instances may be stopped by a system administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Cluster or instance stoppages from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"383e67ec-c393-4e1a-905f-6bb5da3c5d12","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1489/","name":"Service Stop","subtechnique":[],"id":"T1489"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0040/","name":"Impact","id":"TA0040"}}],"to":"now","references":["https://awscli.amazonaws.com/v2/documentation/api/latest/reference/rds/stop-db-cluster.html","https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_StopDBCluster.html","https://awscli.amazonaws.com/v2/documentation/api/latest/reference/rds/stop-db-instance.html","https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_StopDBInstance.html"],"version":5,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-config-*","aws-cloudtrail-*"],"query":"event.action:(StopDBCluster or StopDBInstance) and event.dataset:aws.cloudtrail and event.provider:rds.amazonaws.com and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
