{"id":"d6452f70-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.139Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.926Z","created_by":"admin","name":"[GD] Remote File Download via Desktopimgdownldr Utility","tags":["Command and Control","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies the desktopimgdownldr utility being used to download a remote file. An adversary may use desktopimgdownldr to download arbitrary files as an alternative to certutil.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"3053b8ce-2ee6-415b-8a72-315c4ef3a0ec","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1105/","name":"Ingress Tool Transfer","subtechnique":[],"id":"T1105"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011/","name":"Command and Control","id":"TA0011"}}],"to":"now","references":["https://labs.sentinelone.com/living-off-windows-land-a-new-native-file-downldr/"],"version":5,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and (process.name:desktopimgdownldr.exe or process.pe.original_file_name:desktopimgdownldr.exe) and process.args:/lockscreenurl\\:http*","filters":[],"throttle":"no_actions","actions":[]}
