{"id":"cd49fdb0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:11.925Z","updated_by":"admin","created_at":"2021-09-22T15:57:35.845Z","created_by":"admin","name":"[GD] Process Starting from a Shared Folder","tags":["GD","POC","Windows","Process"],"interval":"5m","enabled":false,"description":"Detect processes starting from shared folders and or mapped drives.","risk_score":47,"severity":"medium","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://cbbf317cf62e4dd9b9913c1cc96ca394.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"timestamp_override":"event.ingested","author":[],"false_positives":[],"from":"now-360s","rule_id":"4dff3128-c32e-4b37-9c93-a1a8bcc8935a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.type : \"start\" and process.executable : \\\\Device\\\\Mup\\\\*","filters":[],"throttle":"no_actions","actions":[]}
