{"id":"d648d8f1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.327Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.922Z","created_by":"admin","name":"[GD] AWS CloudWatch Alarm Deletion","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Monitoring","SecOps"],"interval":"10m","enabled":false,"description":"Identifies the deletion of an AWS CloudWatch alarm. An adversary may delete alarms in an attempt to evade defenses.","risk_score":47,"severity":"medium","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Alarm deletions from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"cee1c48e-6616-451a-8739-949335b4e0a7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1562/","name":"Impair Defenses","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1562/001/","name":"Disable or Modify Tools","id":"T1562.001"}],"id":"T1562"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":["https://awscli.amazonaws.com/v2/documentation/api/latest/reference/cloudwatch/delete-alarms.html","https://docs.aws.amazon.com/AmazonCloudWatch/latest/APIReference/API_DeleteAlarms.html"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-config-*","aws-cloudtrail-*"],"query":"event.action:DeleteAlarms and event.dataset:aws.cloudtrail and event.provider:monitoring.amazonaws.com and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
