{"id":"d1b2fd21-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:42.309Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.309Z","created_by":"admin","name":"[GD] InstallUtil Process Making Network Connections","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies InstallUtil.exe making outbound network connections. This may indicate adversarial activity as InstallUtil is often leveraged by adversaries to execute code and evade detection.","risk_score":21,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"93e5d000-3f70-41f5-93d6-237e076f5b4c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"},"technique":[{"reference":"https://attack.mitre.org/techniques/T1218/","name":"Signed Binary Proxy Execution","id":"T1218","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1218/004/","name":"InstallUtil","id":"T1218.004"}]}]}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"/* the benefit of doing this as an eql sequence vs kql is this will limit to alerting only on the first network connection */\n\nsequence by process.entity_id\n  [process where event.type in (\"start\", \"process_started\") and process.name : \"installutil.exe\"]\n  [network where process.name : \"installutil.exe\" and network.direction == \"outgoing\"]\n","filters":[],"throttle":"no_actions","actions":[]}
