{"id":"d82d9e81-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.498Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.942Z","created_by":"admin","name":"[GD] AWS IAM Brute Force of Assume Role Policy","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Identity and Access","SecOps"],"interval":"5m","enabled":false,"description":"Identifies a high number of failed attempts to assume an AWS Identity and Access Management (IAM) role. IAM roles are used to delegate access to users or services. An adversary may attempt to enumerate IAM roles in order to determine if a role exists before attempting to assume or hijack the discovered role.","risk_score":47,"severity":"medium","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"15m"},"author":["Elastic"],"false_positives":[],"from":"now-1200s","rule_id":"57d55e2e-d8fe-4c7a-9161-626b088c5e9e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1110/","name":"Brute Force","subtechnique":[],"id":"T1110"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}}],"to":"now","references":["https://www.praetorian.com/blog/aws-iam-assume-role-vulnerabilities","https://rhinosecuritylabs.com/aws/assume-worst-aws-assume-role-enumeration/"],"version":4,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["aws-cloudtrail-*","aws-config-*"],"query":"event.dataset:aws.cloudtrail and event.provider:iam.amazonaws.com and event.action:UpdateAssumeRolePolicy and aws.cloudtrail.error_code:MalformedPolicyDocumentException and event.outcome:failure","filters":[],"threshold":{"field":[""],"value":25,"cardinality":[]},"throttle":"no_actions","actions":[]}
