{"id":"d6450861-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:32.794Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.914Z","created_by":"admin","name":"[GD] Bypass UAC via Event Viewer","tags":["Elastic","Host","Privilege Escalation","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies User Account Control (UAC) bypass via eventvwr.exe. Attackers bypass UAC to stealthily execute code with elevated permissions.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"7a608b29-941e-4b75-977e-ec153f7427fa","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1548/","name":"Abuse Elevation Control Mechanism","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1548/002/","name":"Bypass User Access Control","id":"T1548.002"}],"id":"T1548"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0004/","name":"Privilege Escalation","id":"TA0004"}}],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.parent.name:eventvwr.exe and not process.executable:(\"C:\\Windows\\SysWOW64\\mmc.exe\" or \"C:\\Windows\\System32\\mmc.exe\")","filters":[],"throttle":"no_actions","actions":[]}
