{"id":"d1b59531-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:34.135Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.871Z","created_by":"admin","name":"[GD] Unusual Process Execution Path - Alternate Data Stream","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies processes running from an Alternate Data Stream. This is uncommon for legitimate processes and sometimes done by adversaries to hide malware.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"1cfdd722-a538-4b1e-95d9-42d84a73e10b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1564/","name":"Hide Artifacts","subtechnique":[],"id":"T1564"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  process.args : \"C:\\\\*:*\"\n","filters":[],"throttle":"no_actions","actions":[]}
