{"id":"487c91f0-94a9-11ec-b058-3bdfa1ca61dc","updated_at":"2022-03-30T21:13:03.266Z","updated_by":"jprentice1@godaddy.com","created_at":"2022-02-23T13:05:32.836Z","created_by":"admin","name":"[GD] Okta Brute Force - more than 1 useragent and more than 2 source IPs","tags":[],"interval":"1h","enabled":true,"description":"To identify a brute force attack through okta auth","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"10m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-4200s","rule_id":"a4df1ab4-faea-4cd6-b131-8f8271c02b9f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access","id":"TA0006"},"technique":[{"reference":"https://attack.mitre.org/techniques/T1110","name":"Brute Force","id":"T1110","subtechnique":[]}]}],"to":"now","references":[],"version":22,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["*:okta-*"],"query":"event.dataset:okta.system and event.category:authentication and event.outcome:failure","filters":[{"$state":{"store":"appState"},"meta":{"negate":true,"alias":null,"disabled":false,"type":"custom","value":"{\"bool\":{\"should\":[{\"match_phrase\":{\"okta.actor.alternate_id\":\"unknown\"}},{\"match_phrase\":{\"okta.actor.alternate_id\":\"system@okta.com\"}},{\"match_phrase\":{\"okta.actor.alternate_id\":\"ADService@godaddy.com\"}}],\"minimum_should_match\":1}}","key":"query"},"query":{"bool":{"should":[{"match_phrase":{"okta.actor.alternate_id":"unknown"}},{"match_phrase":{"okta.actor.alternate_id":"system@okta.com"}},{"match_phrase":{"okta.actor.alternate_id":"ADService@godaddy.com"}}],"minimum_should_match":1}}},{"$state":{"store":"appState"},"meta":{"negate":true,"alias":null,"disabled":false,"type":"phrase","params":{"query":"/app/office365/exk3q5qqbpJoB61dF0x7/sso/wsfed/username13?"},"key":"url.original"},"query":{"match_phrase":{"url.original":"/app/office365/exk3q5qqbpJoB61dF0x7/sso/wsfed/username13?"}}},{"$state":{"store":"appState"},"meta":{"negate":true,"alias":null,"disabled":false,"type":"phrase","params":{"query":"/app/office365/exk3q5qqbpJoB61dF0x7/sso/wsfed/active?"},"key":"url.original"},"query":{"match_phrase":{"url.original":"/app/office365/exk3q5qqbpJoB61dF0x7/sso/wsfed/active?"}}},{"$state":{"store":"appState"},"meta":{"negate":true,"alias":null,"disabled":false,"type":"custom","value":"{\"bool\":{\"should\":[{\"match_phrase\":{\"okta.client.user_agent.raw_user_agent\":\"unknown\"}},{\"regexp\":{\"okta.client.user_agent.raw_user_agent\":\"Microsoft Office.*\"}},{\"regexp\":{\"okta.client.user_agent.raw_user_agent\":\"AppleExchangeWebServices.*\"}},{\"regexp\":{\"okta.client.user_agent.raw_user_agent\":\"Android-Mail.*\"}},{\"regexp\":{\"okta.client.user_agent.raw_user_agent\":\".*CalendarAgent.*\"}},{\"match_phrase\":{\"okta.client.user_agent.raw_user_agent\":\"Windows-AzureAD-Authentication-Provider/1.0\"}},{\"regexp\":{\"okta.client.user_agent.raw_user_agent\":\"Okta Radius Agent.*\"}},{\"regexp\":{\"okta.client.user_agent.raw_user_agent\":\"PAN GlobalProtect.*\"}},{\"regexp\":{\"okta.client.user_agent.raw_user_agent\":\"Jamf%20Connect.*\"}},{\"regexp\":{\"okta.client.user_agent.raw_user_agent\":\"okta-auth-dotnet-.*\"}},{\"regexp\":{\"okta.client.user_agent.raw_user_agent\":\"SecurityAgentHelper.*\"}}],\"minimum_should_match\":1}}","key":"query"},"query":{"bool":{"should":[{"match_phrase":{"okta.client.user_agent.raw_user_agent":"unknown"}},{"regexp":{"okta.client.user_agent.raw_user_agent":"Microsoft Office.*"}},{"regexp":{"okta.client.user_agent.raw_user_agent":"AppleExchangeWebServices.*"}},{"regexp":{"okta.client.user_agent.raw_user_agent":"Android-Mail.*"}},{"regexp":{"okta.client.user_agent.raw_user_agent":".*CalendarAgent.*"}},{"match_phrase":{"okta.client.user_agent.raw_user_agent":"Windows-AzureAD-Authentication-Provider/1.0"}},{"regexp":{"okta.client.user_agent.raw_user_agent":"Okta Radius Agent.*"}},{"regexp":{"okta.client.user_agent.raw_user_agent":"PAN GlobalProtect.*"}},{"regexp":{"okta.client.user_agent.raw_user_agent":"Jamf%20Connect.*"}},{"regexp":{"okta.client.user_agent.raw_user_agent":"okta-auth-dotnet-.*"}},{"regexp":{"okta.client.user_agent.raw_user_agent":"SecurityAgentHelper.*"}}],"minimum_should_match":1}}},{"$state":{"store":"appState"},"meta":{"field":"client.ip","negate":true,"alias":null,"disabled":false,"params":{"lt":"132.148.54.255","gte":"132.148.54.1"},"type":"range","key":"client.ip"},"query":{"range":{"client.ip":{"lt":"132.148.54.255","gte":"132.148.54.1"}}}},{"$state":{"store":"appState"},"meta":{"field":"client.ip","negate":true,"alias":null,"disabled":false,"params":{"lt":"64.202.160.255","gte":"64.202.160.1"},"type":"range","key":"client.ip"},"query":{"range":{"client.ip":{"lt":"64.202.160.255","gte":"64.202.160.1"}}}},{"$state":{"store":"appState"},"meta":{"negate":true,"alias":null,"disabled":false,"type":"phrases","params":["50.116.41.217","198.58.111.80","192.81.129.227","139.162.220.143"],"key":"client.ip"},"query":{"bool":{"should":[{"match_phrase":{"client.ip":"50.116.41.217"}},{"match_phrase":{"client.ip":"198.58.111.80"}},{"match_phrase":{"client.ip":"192.81.129.227"}},{"match_phrase":{"client.ip":"139.162.220.143"}}],"minimum_should_match":1}}}],"threshold":{"field":["client.ip"],"value":3,"cardinality":[{"field":"okta.client.user_agent.raw_user_agent","value":2}]},"throttle":"rule","actions":[{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"Elastic Test - Okta - Brute Force - more than 1 useragent and more than 2 source IPs\",\n  \"assignment_group\": \"OPS-GCSO\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \"See attached info: (currently in-progress)\\n{{#context.alerts}}\\n{{#signal.threshold_result.terms}}\\nclient.ip: {{value}}\\n{{/signal.threshold_result.terms}}\\nLink to search: {{context.results_link}}\\n{{/context.alerts}}\",\n  \"priority\": \"5\",\n  \"severity\": \"3\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"},{"group":"default","id":"elastic-cloud-email","params":{"subject":"Elastic Alert: {{context.rule.name}}","to":["twhipple1@godaddy.com"],"message":"The alert condition for '{{context.rule.name}}' was triggered.\n\nLink to results: {{context.results_link}}"},"action_type_id":".email"}]}
