{"id":"d3db5b60-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:47.287Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.924Z","created_by":"admin","name":"[GD] Deleting Backup Catalogs with Wbadmin","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies use of the wbadmin.exe to delete the backup catalog. Ransomware and other malware may do this to prevent system recovery.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"07f32dbe-86c8-44a0-ae51-8f744cc97bcb","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1070/","name":"Indicator Removal on Host","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1070/004/","name":"File Deletion","id":"T1070.004"}],"id":"T1070"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":[],"version":9,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.name:wbadmin.exe and process.args:(catalog and delete)","filters":[],"throttle":"no_actions","actions":[]}
