{"id":"d1b1ebb0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:32.786Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.866Z","created_by":"admin","name":"[GD] Remote File Copy to a Hidden Share","tags":["Elastic","Host","Lateral Movement","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies a remote file copy attempt to a hidden network share. This may indicate lateral movement or data staging activity.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"c03a8fc5-aa3f-471c-8e54-b9a12f6f8411","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1021/","name":"Remote Services","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1021/002/","name":"SMB/Windows Admin Shares","id":"T1021.002"}],"id":"T1021"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0008/","name":"Lateral Movement","id":"TA0008"}}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  process.name : (\"cmd.exe\", \"powershell.exe\", \"robocopy.exe\", \"xcopy.exe\") and \n  process.args : (\"copy*\", \"move*\", \"cp\", \"mv\") and process.args : \"*$*\"\n","filters":[],"throttle":"no_actions","actions":[]}
