{"id":"d3da7100-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:11.907Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.905Z","created_by":"admin","name":"[GD] AdFind Command Activity","tags":["Discovery","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"This rule detects the Active Directory query tool, AdFind.exe. AdFind has legitimate purposes, but it is frequently leveraged by threat actors to perform post-exploitation Active Directory reconnaissance. The AdFind tool has been observed in Trickbot, Ryuk, Maze, and FIN6 campaigns. For Winlogbeat, this rule requires Sysmon.","risk_score":21,"severity":"low","note":"`AdFind.exe` is a legitimate domain query tool. Rule alerts should be investigated to identify if the user has a role that would explain using this tool and that it is being run from an expected directory and endpoint. Leverage the exception workflow in the Kibana Security App or Elasticsearch API to tune this rule to your environment.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"1812c1b0-2188-4cec-b564-5790b67dca66","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1069/","name":"Permission Groups Discovery","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1069/002/","name":"Domain Groups","id":"T1069.002"}],"id":"T1069"},{"reference":"https://attack.mitre.org/techniques/T1087/","name":"Account Discovery","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1087/002/","name":"Domain Account","id":"T1087.002"}],"id":"T1087"},{"reference":"https://attack.mitre.org/techniques/T1482/","name":"Domain Trust Discovery","subtechnique":[],"id":"T1482"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0007/","name":"Discovery","id":"TA0007"}}],"to":"now","references":["http://www.joeware.net/freetools/tools/adfind/","https://thedfirreport.com/2020/05/08/adfind-recon/","https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html","https://www.cybereason.com/blog/dropping-anchor-from-a-trickbot-infection-to-the-discovery-of-the-anchor-malware","https://www.fireeye.com/blog/threat-research/2019/04/pick-six-intercepting-a-fin6-intrusion.html","https://usa.visa.com/dam/VCOM/global/support-legal/documents/fin6-cybercrime-group-expands-threat-To-ecommerce-merchants.pdf"],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and \n  (process.name : \"AdFind.exe\" or process.pe.original_file_name == \"AdFind.exe\") and \n  process.args : (\"objectcategory=computer\", \"(objectcategory=computer)\", \n                  \"objectcategory=person\", \"(objectcategory=person)\",\n                  \"objectcategory=subnet\", \"(objectcategory=subnet)\",\n                  \"objectcategory=group\", \"(objectcategory=group)\", \n                  \"objectcategory=organizationalunit\", \"(objectcategory=organizationalunit)\",\n                  \"objectcategory=attributeschema\", \"(objectcategory=attributeschema)\",\n                  \"domainlist\", \"dcmodes\", \"adinfo\", \"dclist\", \"computers_pwnotreqd\", \"trustdmp\")\n","filters":[],"throttle":"no_actions","actions":[]}
