{"id":"d1b19d91-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.813Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.887Z","created_by":"admin","name":"[GD] Microsoft Exchange Server UM Spawning Suspicious Processes","tags":["Elastic","Host","Initial Access","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies suspicious processes being spawned by the Microsoft Exchange Server Unified Messaging (UM) service. This activity has been observed exploiting CVE-2021-26857.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic","Austin Songer"],"false_positives":["Legitimate processes may be spawned from the Microsoft Exchange Server Unified Messaging (UM) service. If known processes are causing false positives, they can be exempted from the rule."],"from":"now-540s","rule_id":"24a180a2-43ae-45ed-9067-057d6f52d52e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1190/","name":"Exploit Public-Facing Application","subtechnique":[],"id":"T1190"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001/","name":"Initial Access","id":"TA0001"}}],"to":"now","references":["https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers","https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities"],"version":2,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type == \"start\" and\n  process.parent.name : (\"UMService.exe\", \"UMWorkerProcess.exe\") and\n    not process.name : (\"werfault.exe\", \"wermgr.exe\")\n","filters":[],"throttle":"no_actions","actions":[]}
