{"id":"d1a43010-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.093Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.863Z","created_by":"admin","name":"[GD] Suspicious Zoom Child Process","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"A suspicious Zoom child process was detected, which may indicate an attempt to run unnoticed. Verify process details such as command line, network connections, file writes and associated file signature details as well.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"84207fb6-194e-4685-95a6-20cd1f4a9d33","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1036/","name":"Masquerading","subtechnique":[],"id":"T1036"},{"reference":"https://attack.mitre.org/techniques/T1055/","name":"Process Injection","subtechnique":[],"id":"T1055"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":[],"version":5,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\", \"info\") and\n process.parent.name : \"Zoom.exe\" and process.name : (\"cmd.exe\", \"powershell.exe\", \"pwsh.exe\")\n","filters":[],"throttle":"no_actions","actions":[]}
