{"id":"d6468f00-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.121Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.920Z","created_by":"admin","name":"[GD] AWS Config Service Tampering","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Monitoring","SecOps"],"interval":"10m","enabled":false,"description":"Identifies attempts to delete an AWS Config Service rule. An adversary may tamper with Config rules in order to reduce visibiltiy into the security posture of an account and / or its workload instances.","risk_score":47,"severity":"medium","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Privileged IAM users with security responsibilities may be expected to make changes to the Config rules in order to align with local security policies and requirements. Automation, orchestration, and security tools may also make changes to the Config service, where they are used to automate setup or configuration of AWS accounts. Other kinds of user or service contexts do not commonly make changes to this service."],"from":"now-3600s","rule_id":"944041aa-a940-4259-b880-8b1fd973c39a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1562/","name":"Impair Defenses","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1562/001/","name":"Disable or Modify Tools","id":"T1562.001"}],"id":"T1562"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":["https://docs.aws.amazon.com/config/latest/developerguide/how-does-config-work.html","https://docs.aws.amazon.com/config/latest/APIReference/API_Operations.html"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-config-*","aws-cloudtrail-*"],"query":"event.dataset: aws.cloudtrail and event.action: DeleteConfigRule and event.provider: config.amazonaws.com","filters":[],"throttle":"no_actions","actions":[]}
