{"id":"d1b54711-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:30.260Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.876Z","created_by":"admin","name":"[GD] Potential DNS Tunneling via NsLookup","tags":["Command and Control","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"This rule identifies a large number (15) of nslookup.exe executions with an explicit query type from the same host. This may indicate command and control activity utilizing the DNS protocol.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"b507a23c-1a55-444e-9c82-0a1255c95a55","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1071/","name":"Application Layer Protocol","subtechnique":[],"id":"T1071"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0011/","name":"Command and Control","id":"TA0011"}}],"to":"now","references":["https://unit42.paloaltonetworks.com/dns-tunneling-in-the-wild-overview-of-oilrigs-dns-tunneling/"],"version":3,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:start and process.name:nslookup.exe and process.args:(-querytype=* or -qt=* or -q=* or -type=*)","filters":[],"threshold":{"field":["host.id"],"value":15,"cardinality":[]},"throttle":"no_actions","actions":[]}
