{"id":"d3da49f1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:47.294Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.913Z","created_by":"admin","name":"[GD] Net command via SYSTEM account","tags":["Discovery","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies the SYSTEM account using an account discovery utility. This could be a sign of discovery activity after an adversary has achieved privilege escalation.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"e928067e-790e-46ab-8614-b211e5579716","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1087/","name":"Account Discovery","subtechnique":[],"id":"T1087"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0007/","name":"Discovery","id":"TA0007"}}],"to":"now","references":[],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and (process.name:(whoami.exe or net.exe) or process.name:net1.exe and not process.parent.name:net.exe) and user.name:SYSTEM","filters":[],"throttle":"no_actions","actions":[]}
