{"id":"d1b2d610-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:30.194Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.889Z","created_by":"admin","name":"[GD] Exporting Exchange Mailbox via PowerShell","tags":["Collection","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies the use of the Exchange PowerShell cmdlet, New-MailBoxExportRequest, to export the contents of a primary mailbox or archive to a .pst file. Adversaries may target user email to collect sensitive information.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Legitimate exchange system administration activity."],"from":"now-540s","rule_id":"bcb3c765-82bf-4a23-a2d7-2a29877eb6f5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1114/","name":"Email Collection","subtechnique":[],"id":"T1114"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0009/","name":"Collection","id":"TA0009"}}],"to":"now","references":["https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/","https://docs.microsoft.com/en-us/powershell/module/exchange/new-mailboxexportrequest?view=exchange-ps"],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  process.name: (\"powershell.exe\", \"pwsh.exe\") and process.args : \"New-MailboxExportRequest*\"\n","filters":[],"throttle":"no_actions","actions":[]}
