{"id":"d1b260e1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:30.166Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.891Z","created_by":"admin","name":"[GD] Potential Evasion via Filter Manager","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"The Filter Manager Control Program (fltMC.exe) binary may be abused by adversaries to unload a filter driver and evade defenses.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"544224a8-d5cf-41e1-aace-783231bc63f3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1222/","name":"File and Directory Permissions Modification","subtechnique":[],"id":"T1222"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":[],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.name:fltMC.exe","filters":[],"throttle":"no_actions","actions":[]}
