{"id":"d646dd20-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:34.224Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.921Z","created_by":"admin","name":"[GD] AWS IAM Password Recovery Requested","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Identity and Access","SecOps"],"interval":"10m","enabled":false,"description":"Identifies AWS IAM password recovery requests. An adversary may attempt to gain unauthorized AWS access by abusing password recovery mechanisms.","risk_score":21,"severity":"low","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Verify whether the user identity, user agent, and/or hostname should be requesting changes in your environment. Password reset attempts from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"31263309-af8d-485b-813b-bcae80ff76f7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1078/","name":"Valid Accounts","subtechnique":[],"id":"T1078"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001/","name":"Initial Access","id":"TA0001"}}],"to":"now","references":["https://www.cadosecurity.com/2020/06/11/an-ongoing-aws-phishing-campaign/"],"version":5,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-cloudtrail-*","aws-config-*"],"query":"event.action:PasswordRecoveryRequested and event.provider:signin.amazonaws.com and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
