{"id":"d82dc591-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2022-03-03T23:14:25.951Z","updated_by":"schoi@godaddy.com","created_at":"2021-09-22T15:57:53.945Z","created_by":"admin","name":"[GD] Okta Brute Force or Password Spraying Attack - BuildingBlock","tags":["Continuous Monitoring","Elastic","Identity","Identity and Access","Okta","SecOps"],"interval":"15m","enabled":true,"description":"Identifies a high number of failed Okta user authentication attempts from a single IP address, which could be indicative of a brute force or password spraying attack. An adversary may attempt a brute force or password spraying attack to obtain unauthorized access to user accounts.","risk_score":47,"severity":"medium","building_block_type":"default","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"author":["Elastic"],"false_positives":["Automated processes that attempt to authenticate using expired credentials and unbounded retries may lead to false positives."],"from":"now-960s","rule_id":"d63a8353-5a37-437a-b0ac-5bbfefa2498c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1110/","name":"Brute Force","subtechnique":[],"id":"T1110"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}}],"to":"now","references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":17,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["okta*","*:okta-*"],"query":"event.dataset:okta.system and event.category:authentication and event.outcome:failure","filters":[],"threshold":{"field":["okta.actor.alternate_id"],"value":60,"cardinality":[]},"throttle":"no_actions","actions":[]}
