{"id":"d3da49f0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:11.917Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.902Z","created_by":"admin","name":"[GD] Execution of Persistent Suspicious Program","tags":["Elastic","Host","Persistence","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies execution of suspicious persistent programs (scripts, rundll32, etc.) by looking at process lineage and command line usage.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"94cb7bc6-26dc-4330-961a-79c1945dc13c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1547/","name":"Boot or Logon Autostart Execution","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1547/001/","name":"Registry Run Keys / Startup Folder","id":"T1547.001"}],"id":"T1547"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}}],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"/* userinit followed by explorer followed by early child process of explorer (unlikely to be launched interactively) within 1m */\nsequence by host.id, user.name with maxspan=1m\n  [process where event.type in (\"start\", \"process_started\") and process.name : \"userinit.exe\" and process.parent.name : \"winlogon.exe\"]\n  [process where event.type in (\"start\", \"process_started\") and process.name : \"explorer.exe\"]\n  [process where event.type in (\"start\", \"process_started\") and process.parent.name : \"explorer.exe\" and\n   /* add suspicious programs here */\n   process.pe.original_file_name in (\"cscript.exe\",\n                                     \"wscript.exe\",\n                                     \"PowerShell.EXE\",\n                                     \"MSHTA.EXE\",\n                                     \"RUNDLL32.EXE\",\n                                     \"REGSVR32.EXE\",\n                                     \"RegAsm.exe\",\n                                     \"MSBuild.exe\",\n                                     \"InstallUtil.exe\") and\n    /* add potential suspicious paths here */\n    process.args : (\"C:\\\\Users\\\\*\", \"C:\\\\ProgramData\\\\*\", \"C:\\\\Windows\\\\Temp\\\\*\", \"C:\\\\Windows\\\\Tasks\\\\*\", \"C:\\\\PerfLogs\\\\*\", \"C:\\\\Intel\\\\*\")\n   ]\n","filters":[],"throttle":"no_actions","actions":[]}
