{"id":"d82ed701-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:20.525Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.954Z","created_by":"admin","name":"[GD] Attempt to Reset MFA Factors for an Okta User Account","tags":["Continuous Monitoring","Elastic","Identity","Identity and Access","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Detects attempts to reset an Okta user's enrolled multi-factor authentication (MFA) factors. An adversary may attempt to reset the MFA factors for an Okta user's account in order to register new MFA factors and abuse the account to blend in with normal activity in the victim's environment.","risk_score":21,"severity":"low","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Consider adding exceptions to this rule to filter false positives if the MFA factors for Okta user accounts are regularly reset in your organization."],"from":"now-360s","rule_id":"12acc659-08c4-4e22-a170-64665af3be5b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1098/","name":"Account Manipulation","subtechnique":[],"id":"T1098"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}}],"to":"now","references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:user.mfa.factor.reset_all","filters":[],"throttle":"no_actions","actions":[]}
