{"id":"d645cbb1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.921Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.930Z","created_by":"admin","name":"[GD] AWS Management Console Root Login","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Identity and Access","SecOps"],"interval":"10m","enabled":false,"description":"Identifies a successful login to the AWS Management Console by the Root user.","risk_score":73,"severity":"high","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["It's strongly recommended that the root user is not used for everyday tasks, including the administrative ones. Verify whether the IP address, location, and/or hostname should be logging in as root in your environment. Unfamiliar root logins should be investigated immediately. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"ee9ccce0-a8a4-4284-bf62-833ce275e93e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1078/","name":"Valid Accounts","subtechnique":[],"id":"T1078"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001/","name":"Initial Access","id":"TA0001"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1078/","name":"Valid Accounts","subtechnique":[],"id":"T1078"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}}],"to":"now","references":["https://docs.aws.amazon.com/IAM/latest/UserGuide/id_root-user.html"],"version":5,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-cloudtrail-*","aws-config-*"],"query":"event.action:ConsoleLogin and event.dataset:aws.cloudtrail and event.provider:signin.amazonaws.com and aws.cloudtrail.user_identity.type:Root and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
