{"id":"d82e61d1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.604Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.955Z","created_by":"admin","name":"[GD] Administrator Role Assigned to an Okta User","tags":["Continuous Monitoring","Elastic","Monitoring","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Identifies when an administrator role is assigned to an Okta user. An adversary may attempt to assign an administrator role to an Okta user in order to assign additional permissions to a user account and maintain access to their target's environment.","risk_score":47,"severity":"medium","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Administrator roles may be assigned to Okta users by a Super Admin user. Verify that the behavior was expected. Exceptions can be added to this rule to filter expected behavior."],"from":"now-360s","rule_id":"15a3b36d-9856-471b-b5a0-38d2c7a7d686","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1098/","name":"Account Manipulation","subtechnique":[],"id":"T1098"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}}],"to":"now","references":["https://help.okta.com/en/prod/Content/Topics/Security/administrators-admin-comparison.htm","https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":4,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:user.account.privilege.grant","filters":[],"throttle":"no_actions","actions":[]}
