{"id":"d1b212c0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.915Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.864Z","created_by":"admin","name":"[GD] Windows Script Interpreter Executing Process via WMI","tags":["Elastic","Host","Initial Access","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies use of the built-in Windows script interpreters (cscript.exe or wscript.exe) being used to execute a process via Windows Management Instrumentation (WMI). This may be indicative of malicious activity.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"69d2f05e-8eff-4846-83d0-e97af7a67ca8","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1566/","name":"Phishing","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1566/001/","name":"Spearphishing Attachment","id":"T1566.001"}],"id":"T1566"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001/","name":"Initial Access","id":"TA0001"}}],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"sequence by host.id with maxspan = 5s\n    [library where dll.name : \"wmiutils.dll\" and process.name : (\"wscript.exe\", \"cscript.exe\")]\n    [process where event.type in (\"start\", \"process_started\") and\n     process.parent.name : \"wmiprvse.exe\" and\n     user.domain != \"NT AUTHORITY\" and\n     (process.pe.original_file_name :\n        (\n          \"cscript.exe\",\n          \"wscript.exe\",\n          \"PowerShell.EXE\",\n          \"Cmd.Exe\",\n          \"MSHTA.EXE\",\n          \"RUNDLL32.EXE\",\n          \"REGSVR32.EXE\",\n          \"MSBuild.exe\",\n          \"InstallUtil.exe\",\n          \"RegAsm.exe\",\n          \"RegSvcs.exe\",\n          \"msxsl.exe\",\n          \"CONTROL.EXE\",\n          \"EXPLORER.EXE\",\n          \"Microsoft.Workflow.Compiler.exe\",\n          \"msiexec.exe\"\n        ) or\n      process.executable : (\"C:\\\\Users\\\\*.exe\", \"C:\\\\ProgramData\\\\*.exe\")\n     )\n    ]\n","filters":[],"throttle":"no_actions","actions":[]}
