{"id":"d6494e21-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:32.716Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.927Z","created_by":"admin","name":"[GD] Remote System Discovery Commands","tags":["Discovery","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Discovery of remote system information using built-in commands, which may be used to mover laterally.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"6cddbe6c-4d4e-4a47-824a-ef59d09b7d25","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1018/","name":"Remote System Discovery","subtechnique":[],"id":"T1018"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0007/","name":"Discovery","id":"TA0007"}}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  (process.name : \"nbtstat.exe\" and process.args : (\"-n\", \"-s\")) or\n  (process.name : \"arp.exe\" and process.args : \"-a\")\n","filters":[],"throttle":"no_actions","actions":[]}
