{"id":"d1a3e1f0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.926Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.875Z","created_by":"admin","name":"[GD] User Added to Privileged Group in Active Directory","tags":["Elastic","Host","Persistence","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies a user being added to a privileged group in Active Directory. Privileged accounts and groups in Active Directory are those to which powerful rights, privileges, and permissions are granted that allow them to perform nearly any action in Active Directory and on domain-joined systems.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic","Skoetting"],"false_positives":[],"from":"now-540s","rule_id":"8a3203de-1f00-47c0-b120-c420301ee48c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1136/","name":"Create Account","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1136/001/","name":"Local Account","id":"T1136.001"}],"id":"T1136"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}}],"to":"now","references":["https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/security-best-practices/appendix-b--privileged-accounts-and-groups-in-active-directory"],"version":3,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:iam and event.action:\"added-member-to-group\" and group.name:(Administrators or \"Local Administrators\" or \"Domain Admins\" or \"Enterprise Admins\" or \"Backup Admins\" or \"Schema Admins\" or \"DnsAdmins\" or \"SecOps\")","filters":[],"throttle":"no_actions","actions":[]}
