{"id":"d3d7d8f1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:47.229Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.898Z","created_by":"admin","name":"[GD] Execution of COM object via Xwizard","tags":["Elastic","Execution","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Windows Component Object Model (COM) is an inter-process communication (IPC) component of the native Windows application programming interface (API) that enables interaction between software objects or executable code. Xwizard can be used to run a COM object created in registry to evade defensive counter measures.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"c51db843-739b-4814-9d98-0ddf09bb22b0","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1559/","name":"Inter-Process Communication","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1559/001/","name":"Component Object Model","id":"T1559.001"}],"id":"T1559"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002/","name":"Execution","id":"TA0002"}}],"to":"now","references":["https://lolbas-project.github.io/lolbas/Binaries/Xwizard/","http://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/"],"version":2,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n process.pe.original_file_name : \"xwizard.exe\" and\n (\n   (process.args : \"RunWizard\" and process.args : \"{*}\") or\n   (process.executable != null and\n     not process.executable : (\"C:\\\\Windows\\\\SysWOW64\\\\xwizard.exe\", \"C:\\\\Windows\\\\System32\\\\xwizard.exe\")\n   )\n )\n","filters":[],"throttle":"no_actions","actions":[]}
