{"id":"d1a25b50-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:32.731Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.865Z","created_by":"admin","name":"[GD] Microsoft Build Engine Started by an Office Application","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"An instance of MSBuild, the Microsoft Build Engine, was started by Excel or Word. This is unusual behavior for the Build Engine and could have been caused by an Excel or Word document executing a malicious script payload.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["The Build Engine is commonly used by Windows developers but use by non-engineers is unusual. It is quite unusual for this program to be started by an Office application like Word or Excel."],"from":"now-540s","rule_id":"8a2575fd-a464-4b8c-bebf-e03159c2c30a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1127/","name":"Trusted Developer Utilities Proxy Execution","subtechnique":[],"id":"T1127"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}},{"framework":"MITRE ATT&CK","technique":[],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002/","name":"Execution","id":"TA0002"}}],"to":"now","references":["https://blog.talosintelligence.com/2020/02/building-bypass-with-msbuild.html"],"version":8,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.name:MSBuild.exe and process.parent.name:(eqnedt32.exe or excel.exe or fltldr.exe or msaccess.exe or mspub.exe or outlook.exe or powerpnt.exe or winword.exe)","filters":[],"throttle":"no_actions","actions":[]}
