{"id":"d3dae630-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:11.879Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.911Z","created_by":"admin","name":"[GD] Suspicious Explorer Child Process","tags":["Elastic","Host","Initial Access","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies a suspicious Windows explorer child process. Explorer.exe can be abused to launch malicious scripts or executables from a trusted parent process.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"82662dbb-cdff-4100-8b48-8268ad387020","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1566/","name":"Phishing","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1566/001/","name":"Spearphishing Attachment","id":"T1566.001"},{"reference":"https://attack.mitre.org/techniques/T1566/002/","name":"Spearphishing Link","id":"T1566.002"}],"id":"T1566"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001/","name":"Initial Access","id":"TA0001"}}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  process.name : (\"cscript.exe\", \"wscript.exe\", \"powershell.exe\", \"rundll32.exe\", \"cmd.exe\", \"mshta.exe\", \"regsvr32.exe\") and\n  /* Explorer started via DCOM */\n  process.parent.name : \"explorer.exe\" and process.parent.args : \"-Embedding\"\n","filters":[],"throttle":"no_actions","actions":[]}
