{"id":"d1ad7ee0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:30.172Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.879Z","created_by":"admin","name":"[GD] Suspicious Endpoint Security Parent Process","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"A suspicious Endpoint Security parent process was detected. This may indicate a process hollowing or other form of code injection.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"e3b4b951-dda3-4ce3-ae32-74ec34c82f72","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1036/","name":"Masquerading","subtechnique":[],"id":"T1036"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":[],"version":5,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\", \"info\") and\n process.name : (\"esensor.exe\", \"elastic-endpoint.exe\") and\n process.parent.executable != null and\n  /* add FPs here */\n not process.parent.executable : (\"C:\\\\Program Files\\\\Elastic\\\\*\", \n                                  \"C:\\\\Windows\\\\System32\\\\services.exe\", \n                                  \"C:\\\\Windows\\\\System32\\\\WerFault*.exe\", \n                                  \"C:\\\\Windows\\\\System32\\\\wermgr.exe\")\n","filters":[],"throttle":"no_actions","actions":[]}
