{"id":"d82e88e1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.426Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.949Z","created_by":"admin","name":"[GD] Attempt to Create Okta API Token","tags":["Continuous Monitoring","Elastic","Identity","Monitoring","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Detects attempts to create an Okta API token. An adversary may create an Okta API token to maintain access to an organization's network while they work to achieve their objectives. An attacker may abuse an API token to execute techniques such as creating user accounts or disabling security rules or policies.","risk_score":47,"severity":"medium","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["If the behavior of creating Okta API tokens is expected, consider adding exceptions to this rule to filter false positives."],"from":"now-360s","rule_id":"3f90b225-3965-45c2-8faa-a1eaa9c647bf","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1136/","name":"Create Account","subtechnique":[],"id":"T1136"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}}],"to":"now","references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:system.api_token.create","filters":[],"throttle":"no_actions","actions":[]}
