{"id":"398f9b30-6293-11ec-9d1e-5b56ec0d9762","updated_at":"2021-12-21T19:22:46.810Z","updated_by":"admin","created_at":"2021-12-21T19:21:40.712Z","created_by":"admin","name":"[GD] PCI - Detected Modification of Windows Firewall Rules","tags":["GD"],"interval":"30m","enabled":false,"description":"Waiting until pci_windows_* are ingested before enabling this detection\nThis rule performs actions of both Splunk Rules: PCI - Detected Modification of Windows Firewall Rules AND PCI - Windows Firewall Disabled","risk_score":42,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://827ebd6fd06146bea2d2ad3a453d7e43.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"author":[],"false_positives":[],"from":"now-1860s","rule_id":"dcd4e000-1c46-445e-902f-56bc10c968c7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"","filters":[{"meta":{"type":"phrases","key":"event.code","params":["4946","4947","4948","4950"],"alias":null,"negate":false,"disabled":false},"query":{"bool":{"should":[{"match_phrase":{"event.code":"4946"}},{"match_phrase":{"event.code":"4947"}},{"match_phrase":{"event.code":"4948"}},{"match_phrase":{"event.code":"4950"}}],"minimum_should_match":1}},"$state":{"store":"appState"}}],"throttle":"no_actions","actions":[]}
