{"id":"d1a3bae1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:34.246Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.866Z","created_by":"admin","name":"[GD] Volume Shadow Copy Deletion via VssAdmin","tags":["Elastic","Host","Impact","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies use of vssadmin.exe for shadow copy deletion on endpoints. This commonly occurs in tandem with ransomware or other destructive attacks.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"4d05ee7d-7ca3-4412-9625-4c625d57b851","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1490/","name":"Inhibit System Recovery","subtechnique":[],"id":"T1490"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0040/","name":"Impact","id":"TA0040"}}],"to":"now","references":[],"version":9,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.name:vssadmin.exe and process.args:(delete and shadows)","filters":[],"throttle":"no_actions","actions":[]}
