{"id":"d1a3bae0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.116Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.869Z","created_by":"admin","name":"[GD] UAC Bypass via DiskCleanup Scheduled Task Hijack","tags":["Elastic","Host","Privilege Escalation","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies User Account Control (UAC) bypass via hijacking DiskCleanup Scheduled Task. Attackers bypass UAC to stealthily execute code with elevated permissions.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"2e305d86-414b-4ec7-9536-50f6d7b157c0","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1548/","name":"Abuse Elevation Control Mechanism","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1548/002/","name":"Bypass User Access Control","id":"T1548.002"}],"id":"T1548"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0004/","name":"Privilege Escalation","id":"TA0004"}}],"to":"now","references":[],"version":5,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\nprocess.args:\"/autoclean\" and process.args:\"/d\" and\nnot process.executable : (\"C:\\\\Windows\\\\System32\\\\cleanmgr.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\cleanmgr.exe\")\n","filters":[],"throttle":"no_actions","actions":[]}
