{"id":"cf8b1411-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.687Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.687Z","created_by":"admin","name":"[GD] External Alerts","tags":["APM","Elastic","Linux","macOS","Network","Windows"],"interval":"5m","enabled":false,"description":"Generates a detection alert for each external alert written to the configured indices. Enabling this rule allows you to immediately begin investigating external alerts in the app.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"rule_name_override":"message","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-360s","rule_id":"c5e07e3e-fa60-45da-9298-7d6c5bfb8636","max_signals":10000,"risk_score_mapping":[{"field":"event.risk_score","value":"","operator":"equals"}],"severity_mapping":[{"severity":"low","field":"event.severity","value":"21","operator":"equals"},{"severity":"medium","field":"event.severity","value":"47","operator":"equals"},{"severity":"high","field":"event.severity","value":"73","operator":"equals"},{"severity":"critical","field":"event.severity","value":"99","operator":"equals"}],"threat":[],"to":"now","references":[],"version":5,"exceptions_list":[{"list_id":"51420a42-9597-47c6-9ca4-0061d362e476","namespace_type":"single","id":"d2c21610-be9d-11eb-8d42-f725f3c7ec37","type":"detection"}],"immutable":false,"type":"query","language":"kuery","index":["carbon-black-*","tanium-*"],"query":"event.kind:alert and not event.module:(endgame or endpoint)","filters":[],"throttle":"no_actions","actions":[]}
