{"id":"d3dfa121-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:47.215Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.912Z","created_by":"admin","name":"[GD] NTDS or SAM Database File Copied","tags":["Credential Access","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies a copy operation of the Active Directory Domain Database (ntds.dit) or Security Account Manager (SAM) files. Those files contain sensitive information including hashed domain and/or local credentials.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"182928ea-936a-4647-924e-4fb57370e1c7","max_signals":33,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1003/","name":"OS Credential Dumping","subtechnique":[],"id":"T1003"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}}],"to":"now","references":["https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/"],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n process.pe.original_file_name in (\"Cmd.Exe\", \"PowerShell.EXE\", \"XCOPY.EXE\") and\n process.args : (\"copy\", \"xcopy\", \"Copy-Item\", \"move\", \"cp\", \"mv\") and\n process.args : (\"*\\\\ntds.dit\", \"*\\\\config\\\\SAM\", \"\\\\*\\\\GLOBALROOT\\\\Device\\\\HarddiskVolumeShadowCopy*\\\\*\")\n","filters":[],"throttle":"no_actions","actions":[]}
