{"id":"d81ef880-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:20.531Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.948Z","created_by":"admin","name":"[GD] AWS Configuration Recorder Stopped","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Monitoring","SecOps"],"interval":"10m","enabled":false,"description":"Identifies an AWS configuration change to stop recording a designated set of resources.","risk_score":73,"severity":"high","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Recording changes from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"22e5ab17-51b6-4241-9876-cae7075b1e0b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1562/","name":"Impair Defenses","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1562/001/","name":"Disable or Modify Tools","id":"T1562.001"}],"id":"T1562"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":["https://awscli.amazonaws.com/v2/documentation/api/latest/reference/configservice/stop-configuration-recorder.html","https://docs.aws.amazon.com/config/latest/APIReference/API_StopConfigurationRecorder.html"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-cloudtrail-*","aws-config-*"],"query":"event.action:StopConfigurationRecorder and event.dataset:aws.cloudtrail and event.provider:config.amazonaws.com and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
