{"id":"d647ee91-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.924Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.933Z","created_by":"admin","name":"[GD] AWS EC2 Snapshot Activity","tags":["Asset Visibility","AWS","Cloud","Continuous Monitoring","Elastic","SecOps"],"interval":"10m","enabled":false,"description":"An attempt was made to modify AWS EC2 snapshot attributes. Snapshots are sometimes shared by threat actors in order to exfiltrate bulk data from an EC2 fleet. If the permissions were modified, verify the snapshot was not shared with an unauthorized or unexpected AWS account.","risk_score":47,"severity":"medium","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["IAM users may occasionally share EC2 snapshots with another AWS account belonging to the same organization. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"c1436428-cc3d-4d91-8ae8-b94d0612163d","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1537/","name":"Transfer Data to Cloud Account","subtechnique":[],"id":"T1537"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0010/","name":"Exfiltration","id":"TA0010"}}],"to":"now","references":["https://awscli.amazonaws.com/v2/documentation/api/latest/reference/ec2/modify-snapshot-attribute.html","https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_ModifySnapshotAttribute.html"],"version":5,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-cloudtrail-*","aws-config-*"],"query":"event.dataset:aws.cloudtrail and event.provider:ec2.amazonaws.com and event.action:ModifySnapshotAttribute","filters":[],"throttle":"no_actions","actions":[]}
