{"id":"d3d9adb0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:47.214Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.904Z","created_by":"admin","name":"[GD] Encoding or Decoding Files via CertUtil","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies the use of certutil.exe to encode or decode data. CertUtil is a native Windows component which is part of Certificate Services. CertUtil is often abused by attackers to encode or decode base64 data for stealthier command and control or exfiltration.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"51beddec-0664-4a12-bd8c-7c24d41d5c52","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1140/","name":"Deobfuscate/Decode Files or Information","subtechnique":[],"id":"T1140"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.name:certutil.exe and process.args:(-decode or -encode or /decode or /encode)","filters":[],"throttle":"no_actions","actions":[]}
