{"id":"6e4c27b0-5c4b-11ec-9fcb-3bc48f034fff","updated_at":"2021-12-13T19:32:39.354Z","updated_by":"admin","created_at":"2021-12-13T19:32:39.354Z","created_by":"admin","name":"[GD] Customer API Key add Dashboard - IPs above limit","tags":["GD","SSO"],"interval":"24h","enabled":true,"description":"Generates events if count by IP is above 50 over the last 24 hours","risk_score":21,"severity":"low","building_block_type":"default","license":"","output_index":".siem-signals-default","meta":{"from":"24h","kibana_siem_app_url":"https://827ebd6fd06146bea2d2ad3a453d7e43.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"author":[],"false_positives":[],"from":"now-172800s","rule_id":"e3840362-af02-41a1-b9db-be77d6c79ba3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["onprem-*"],"query":"aws.fluent_tags: \"SSO\" and event.action: \"add_apikey\"","filters":[],"threshold":{"field":["source.ip.keyword"],"value":50,"cardinality":[]},"throttle":"no_actions","actions":[]}
