{"id":"d1a40901-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.927Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.869Z","created_by":"admin","name":"[GD] Process Discovery via Tasklist","tags":["Discovery","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Adversaries may attempt to get information about running processes on a system.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Administrators may use the tasklist command to display a list of currently running processes. By itself, it does not indicate malicious activity. After obtaining a foothold, it's possible adversaries may use discovery commands like tasklist to get information about running processes."],"from":"now-540s","rule_id":"5464835e-3f52-4bd1-a822-29098abffa07","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1057/","name":"Process Discovery","subtechnique":[],"id":"T1057"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0007/","name":"Discovery","id":"TA0007"}}],"to":"now","references":[],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.name:tasklist.exe","filters":[],"throttle":"no_actions","actions":[]}
