{"id":"d645a4a0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:32.800Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.915Z","created_by":"admin","name":"[GD] AWS EC2 Network Access Control List Deletion","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Network Security","SecOps"],"interval":"10m","enabled":false,"description":"Identifies the deletion of an Amazon Elastic Compute Cloud (EC2) network access control list (ACL) or one of its ingress/egress entries.","risk_score":47,"severity":"medium","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Network ACL's may be deleted by a network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Network ACL deletions from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"42569ffb-37de-4977-9512-a759f04d0caa","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1562/","name":"Impair Defenses","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1562/001/","name":"Disable or Modify Tools","id":"T1562.001"}],"id":"T1562"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":["https://awscli.amazonaws.com/v2/documentation/api/latest/reference/ec2/delete-network-acl.html","https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_DeleteNetworkAcl.html","https://awscli.amazonaws.com/v2/documentation/api/latest/reference/ec2/delete-network-acl-entry.html","https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_DeleteNetworkAclEntry.html"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-cloudtrail-*","aws-config-*"],"query":"event.action:(DeleteNetworkAcl or DeleteNetworkAclEntry) and event.dataset:aws.cloudtrail and event.provider:ec2.amazonaws.com and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
