{"id":"d648d8f0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.911Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.932Z","created_by":"admin","name":"[GD] AWS IAM User Addition to Group","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Identity and Access","SecOps"],"interval":"10m","enabled":false,"description":"Identifies the addition of a user to a specified group in AWS Identity and Access Management (IAM).","risk_score":21,"severity":"low","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Adding users to a specified group may be done by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. User additions from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"3061e022-891d-42c8-804f-2192f12cc6ce","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}},{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1098/","name":"Account Manipulation","subtechnique":[],"id":"T1098"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}}],"to":"now","references":["https://docs.aws.amazon.com/IAM/latest/APIReference/API_AddUserToGroup.html"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-cloudtrail-*","aws-config-*"],"query":"event.action:AddUserToGroup and event.dataset:aws.cloudtrail and event.provider:iam.amazonaws.com and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
