{"id":"d1b87b60-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:30.264Z","updated_by":"admin","created_at":"2021-09-22T15:57:42.878Z","created_by":"admin","name":"[GD] Persistence via WMI Event Subscription","tags":["Elastic","Host","Persistence","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"An adversary can use Windows Management Instrumentation (WMI) to install event filters, providers, consumers, and bindings that execute code when a defined event occurs. Adversaries may use the capabilities of WMI to subscribe to an event and execute arbitrary code when that event occurs, providing persistence on a system.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"7fcc4f27-c3f6-4c2e-805a-59c255900ca6","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1546/","name":"Event Triggered Execution","subtechnique":[],"id":"T1546"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  (process.name : \"wmic.exe\" or process.pe.original_file_name == \"wmic.exe\") and\n  process.args : \"create\" and\n  process.args : (\"ActiveScriptEventConsumer\", \"CommandLineEventConsumer\")\n","filters":[],"throttle":"no_actions","actions":[]}
