{"id":"cd45df01-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:11.933Z","updated_by":"admin","created_at":"2021-09-22T15:57:35.841Z","created_by":"admin","name":"[GD] Okta Failed Authentication Sequence ","tags":["Okta","GD","POC"],"interval":"5m","enabled":false,"description":"If a user fails 3 times, but then is successful.","risk_score":66,"severity":"medium","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://cbbf317cf62e4dd9b9913c1cc96ca394.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"timestamp_override":"event.ingested","author":[],"false_positives":[],"from":"now-360s","rule_id":"f3baef76-8735-429a-8035-a2a6b870de9b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["okta-*"],"query":"sequence by user.full_name, source.ip\n  [authentication where event.outcome == \"failure\"]\n  [authentication where event.outcome == \"failure\"]\n  [authentication where event.outcome == \"failure\"]\n  [authentication where event.outcome == \"success\"]","filters":[],"throttle":"no_actions","actions":[]}
