{"id":"d82e13b1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.427Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.943Z","created_by":"admin","name":"[GD] Attempted Bypass of Okta MFA","tags":["Continuous Monitoring","Elastic","Identity","Identity and Access","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Detects attempts to bypass Okta multi-factor authentication (MFA). An adversary may attempt to bypass the Okta MFA policies configured for an organization in order to obtain unauthorized access to an application.","risk_score":73,"severity":"high","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-360s","rule_id":"21576526-cd88-45e9-97ec-43b769d09abb","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1111/","name":"Two-Factor Authentication Interception","subtechnique":[],"id":"T1111"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}}],"to":"now","references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:user.mfa.attempt_bypass","filters":[],"throttle":"no_actions","actions":[]}
