{"id":"d82e3ac0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.550Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.953Z","created_by":"admin","name":"[GD] AWS Execution via System Manager ","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Log Auditing","SecOps"],"interval":"10m","enabled":false,"description":"Identifies the execution of commands and scripts via System Manager. Execution methods such as RunShellScript, RunPowerShellScript, and alike can be abused by an authenticated attacker to install a backdoor or to interact with a compromised instance via reverse-shell using system only commands.","risk_score":21,"severity":"low","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Suspicious commands from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"125e2f43-d19a-4309-8f16-851eba9b11b3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1566/","name":"Phishing","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1566/002/","name":"Spearphishing Link","id":"T1566.002"}],"id":"T1566"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0001/","name":"Initial Access","id":"TA0001"}}],"to":"now","references":["https://docs.aws.amazon.com/systems-manager/latest/userguide/ssm-plugins.html"],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-config-*","aws-cloudtrail-*"],"query":"event.dataset:aws.cloudtrail and event.provider:ssm.amazonaws.com and event.action:SendCommand and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
