{"id":"d82efe10-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.542Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.951Z","created_by":"admin","name":"[GD] Attempt to Delete an Okta Policy","tags":["Continuous Monitoring","Elastic","Identity","Monitoring","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Detects attempts to delete an Okta policy. An adversary may attempt to delete an Okta policy in order to weaken an organization's security controls. For example, an adversary may attempt to delete an Okta multi-factor authentication (MFA) policy in order to weaken the authentication requirements for user accounts.","risk_score":47,"severity":"medium","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Consider adding exceptions to this rule to filter false positives if Okta policies are regularly deleted in your organization."],"from":"now-360s","rule_id":"b24872fa-7004-4bdc-bdad-348d20089ea7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://help.okta.com/en/prod/Content/Topics/Security/Security_Policies.htm","https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:policy.lifecycle.delete","filters":[],"throttle":"no_actions","actions":[]}
