{"id":"d3d95f90-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:47.216Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.915Z","created_by":"admin","name":"[GD] Execution via MSSQL xp_cmdshell Stored Procedure","tags":["Elastic","Execution","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies execution via MSSQL xp_cmdshell stored procedure. Malicious users may attempt to elevate their privileges by using xp_cmdshell, which is disabled by default, thus, it's important to review the context of it's use.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"92825812-c7a5-457e-b810-e0108484428b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1059/","name":"Command and Scripting Interpreter","subtechnique":[],"id":"T1059"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002/","name":"Execution","id":"TA0002"}}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["windows-*"],"query":"event.category:process and event.type:(start or process_started) and process.name:cmd.exe and process.parent.name:sqlservr.exe","filters":[],"throttle":"no_actions","actions":[]}
