{"id":"d3dfa120-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:34.012Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.904Z","created_by":"admin","name":"[GD] Suspicious WMIC XSL Script Execution","tags":["Defense Evasion","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies WMIC whitelisting bypass techniques by alerting on suspicious execution of scripts. When WMIC loads scripting libraries it may be indicative of a whitelist bypass.","risk_score":21,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"a4b8f404-7336-4c6a-9c96-c3f3bdc20a43","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1220/","name":"XSL Script Processing","subtechnique":[],"id":"T1220"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005/","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"sequence by process.entity_id with maxspan = 2m\n[process where event.type in (\"start\", \"process_started\") and\n   (process.name : \"WMIC.exe\" or process.pe.original_file_name : \"wmic.exe\") and\n   process.args : (\"format*:*\", \"/format*:*\", \"*-format*:*\") and\n   not process.command_line : \"* /format:table *\"]\n[library where event.type == \"start\" and dll.name : (\"jscript.dll\", \"vbscript.dll\")]\n","filters":[],"throttle":"no_actions","actions":[]}
