{"id":"d82e88e0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.600Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.944Z","created_by":"admin","name":"[GD] Attempt to Modify an Okta Network Zone","tags":["Continuous Monitoring","Elastic","Identity","Network Security","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Detects attempts to modify an Okta network zone. Okta network zones can be configured to limit or restrict access to a network based on IP addresses or geolocations. An adversary may attempt to modify, delete, or deactivate an Okta network zone in order to remove or weaken an organization's security controls.","risk_score":47,"severity":"medium","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Consider adding exceptions to this rule to filter false positives if Oyour organization's Okta network zones are regularly modified."],"from":"now-360s","rule_id":"e9d1c573-8b3b-4b24-a35c-76ae14cb7eff","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://help.okta.com/en/prod/Content/Topics/Security/network/network-zones.htm","https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:(zone.update or network_zone.rule.disabled or zone.remove_blacklist)","filters":[],"throttle":"no_actions","actions":[]}
