{"id":"d6457d91-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:32.795Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.919Z","created_by":"admin","name":"[GD] UAC Bypass Attempt via Windows Directory Masquerading","tags":["Elastic","Host","Privilege Escalation","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies an attempt to bypass User Account Control (UAC) by masquerading as a Microsoft trusted Windows directory. Attackers may bypass UAC to stealthily execute code with elevated permissions.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"6acc2b29-26bd-443d-9d67-18fec685562a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1548/","name":"Abuse Elevation Control Mechanism","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1548/002/","name":"Bypass User Access Control","id":"T1548.002"}],"id":"T1548"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0004/","name":"Privilege Escalation","id":"TA0004"}}],"to":"now","references":["https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e"],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  process.args : (\"C:\\\\Windows \\\\system32\\\\*.exe\", \"C:\\\\Windows \\\\SysWOW64\\\\*.exe\")\n","filters":[],"throttle":"no_actions","actions":[]}
