{"id":"d3db0d41-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:32.809Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.941Z","created_by":"admin","name":"[GD] Microsoft IIS Connection Strings Decryption","tags":["Credential Access","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies use of aspnet_regiis to decrypt Microsoft IIS connection strings. An attacker with Microsoft IIS web server access via a webshell or alike can decrypt and dump any hardcoded connection strings, such as the MSSQL service account password using aspnet_regiis command.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"470114cd-d901-43b8-ad04-168d2927a671","max_signals":33,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1003/","name":"OS Credential Dumping","subtechnique":[],"id":"T1003"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}}],"to":"now","references":["https://blog.netspi.com/decrypting-iis-passwords-to-break-out-of-the-dmz-part-1/","https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/greenbug-espionage-telco-south-asia"],"version":5,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  (process.name : \"aspnet_regiis.exe\" or process.pe.original_file_name == \"aspnet_regiis.exe\") and\n  process.args : \"connectionStrings\" and process.args : \"-pdf\"\n","filters":[],"throttle":"no_actions","actions":[]}
