{"id":"d647a070-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:20.539Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.931Z","created_by":"admin","name":"[GD] Suspicious Process Execution via Renamed PsExec Executable","tags":["Elastic","Execution","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies suspicious psexec activity which is executing from the psexec service that has been renamed, possibly to evade detection.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"22b1b22a-8ec6-4ac1-bd56-5d097018b943","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1569/","name":"System Services","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1569/002/","name":"Service Execution","id":"T1569.002"}],"id":"T1569"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0002/","name":"Execution","id":"TA0002"}}],"to":"now","references":[],"version":5,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\", \"info\") and\n  process.pe.original_file_name : \"psexesvc.exe\" and not process.name : \"PSEXESVC.exe\"\n","filters":[],"throttle":"no_actions","actions":[]}
