{"id":"d832a790-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.632Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.949Z","created_by":"admin","name":"[GD] Attempt to Deactivate MFA for an Okta User Account","tags":["Continuous Monitoring","Elastic","Identity","Identity and Access","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Detects attempts to deactivate multi-factor authentication (MFA) for an Okta user. An adversary may deactivate MFA for an Okta user account in order to weaken the authentication requirements for the account.","risk_score":21,"severity":"low","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["If the behavior of deactivating MFA for Okta user accounts is expected, consider adding exceptions to this rule to filter false positives."],"from":"now-360s","rule_id":"21be6576-bffd-468b-ba14-a202f9b0e4b5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1098/","name":"Account Manipulation","subtechnique":[],"id":"T1098"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003/","name":"Persistence","id":"TA0003"}}],"to":"now","references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:user.mfa.factor.deactivate","filters":[],"throttle":"no_actions","actions":[]}
