{"id":"d647ee90-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:34.192Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.930Z","created_by":"admin","name":"[GD] AWS Root Login Without MFA","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Identity and Access","SecOps"],"interval":"10m","enabled":false,"description":"Identifies attempts to login to AWS as the root user without using multi-factor authentication (MFA). Amazon AWS best practices indicate that the root user should be protected by MFA.","risk_score":73,"severity":"high","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Some organizations allow login with the root user without MFA, however, this is not considered best practice by AWS and increases the risk of compromised credentials."],"from":"now-3600s","rule_id":"41716ef8-eb85-49d5-9dd2-5b8dc54650d4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1078/","name":"Valid Accounts","subtechnique":[],"id":"T1078"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0004/","name":"Privilege Escalation","id":"TA0004"}}],"to":"now","references":["https://docs.aws.amazon.com/IAM/latest/UserGuide/id_root-user.html"],"version":5,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-config-*","aws-cloudtrail-*"],"query":"event.dataset:aws.cloudtrail and event.provider:signin.amazonaws.com and event.action:ConsoleLogin and aws.cloudtrail.user_identity.type:Root and aws.cloudtrail.console_login.additional_eventdata.mfa_used:false and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
