{"id":"d6452f71-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.231Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.914Z","created_by":"admin","name":"[GD] Enumeration of Administrator Accounts","tags":["Discovery","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies instances of lower privilege accounts enumerating Administrator accounts or groups using built-in Windows tools.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"9b158842-61a4-4ede-a40a-ea2c2890ef31","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1069/","name":"Permission Groups Discovery","subtechnique":[],"id":"T1069"},{"reference":"https://attack.mitre.org/techniques/T1087/","name":"Account Discovery","subtechnique":[],"id":"T1087"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0007/","name":"Discovery","id":"TA0007"}}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  (((process.name : \"net.exe\" or process.pe.original_file_name == \"net.exe\") or\n    ((process.name : \"net1.exe\" or process.pe.original_file_name == \"net1.exe\") and\n        not process.parent.name : \"net.exe\")) and\n   process.args : (\"group\", \"user\", \"localgroup\") and\n   process.args : (\"admin\", \"Domain Admins\", \"Remote Desktop Users\", \"Enterprise Admins\", \"Organization Management\") and\n   not process.args : \"/add\")\n\n   or\n\n  ((process.name : \"wmic.exe\" or process.pe.original_file_name == \"wmic.exe\") and\n     process.args : (\"group\", \"useraccount\"))\n","filters":[],"throttle":"no_actions","actions":[]}
