{"id":"d648b1e1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.229Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.924Z","created_by":"admin","name":"[GD] Encrypting Files with WinRar or 7z","tags":["Collection","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies use of WinRar or 7z to create an encrypted files. Adversaries will often compress and encrypt data in preparation for exfiltration.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"c2b69f94-d469-4731-8350-00ca1c8d994b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1560/","name":"Archive Collected Data","subtechnique":[],"id":"T1560"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0009/","name":"Collection","id":"TA0009"}}],"to":"now","references":["https://www.welivesecurity.com/2020/12/02/turla-crutch-keeping-back-door-open/"],"version":5,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  ((process.name:\"rar.exe\" or process.code_signature.subject_name == \"win.rar GmbH\" or\n      process.pe.original_file_name == \"Command line RAR\") and\n    process.args == \"a\" and process.args : (\"-hp*\", \"-p*\", \"-dw\", \"-tb\", \"-ta\", \"/hp*\", \"/p*\", \"/dw\", \"/tb\", \"/ta\"))\n\n  or\n  (process.pe.original_file_name in (\"7z.exe\", \"7za.exe\") and\n     process.args == \"a\" and process.args : (\"-p*\", \"-sdel\"))\n\n  /* uncomment if noisy for backup software related FPs */\n  /* not process.parent.executable : (\"C:\\\\Program Files\\\\*.exe\", \"C:\\\\Program Files (x86)\\\\*.exe\") */\n","filters":[],"throttle":"no_actions","actions":[]}
