{"id":"cf8d0fe0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.439Z","updated_by":"admin","created_at":"2021-09-22T15:57:39.721Z","created_by":"admin","name":"[GD] Suspicious RDP ActiveX Client Loaded","tags":["Elastic","Host","Lateral Movement","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies suspicious Image Loading of the Remote Desktop Services ActiveX Client (mstscax), this may indicate the presence of RDP lateral movement capability.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"67efbc5b-932d-412f-ad20-70decd5a8742","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1021/","name":"Remote Services","subtechnique":[],"id":"T1021"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0008/","name":"Lateral Movement","id":"TA0008"}}],"to":"now","references":["https://posts.specterops.io/revisiting-remote-desktop-lateral-movement-8fb905cb46c3"],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"library where dll.name : \"mstscax.dll\" and\n   /* depending on noise in your env add here extra paths  */\n  process.executable :\n    (\n    \"C:\\\\Windows\\\\*\",\n    \"C:\\\\Users\\\\Public\\\\*\",\n    \"C:\\\\Users\\\\Default\\\\*\",\n    \"C:\\\\Intel\\\\*\",\n    \"C:\\\\PerfLogs\\\\*\",\n    \"C:\\\\ProgramData\\\\*\",\n    \"\\\\Device\\\\Mup\\\\*\",\n    \"\\\\\\\\*\"\n    ) and\n    /* add here FPs */\n  not process.executable : (\"C:\\\\Windows\\\\System32\\\\mstsc.exe\", \"C:\\\\Windows\\\\SysWOW64\\\\mstsc.exe\")\n","filters":[],"throttle":"no_actions","actions":[]}
