{"id":"d832cea0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:20.526Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.953Z","created_by":"admin","name":"[GD] Attempt to Deactivate an Okta Policy Rule","tags":["Continuous Monitoring","Elastic","Identity","Identity and Access","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Detects attempts to deactivate a rule within an Okta policy. An adversary may attempt to deactivate a rule within an Okta policy in order to remove or weaken an organization's security controls.","risk_score":47,"severity":"medium","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Consider adding exceptions to this rule to filter false positives if Okta MFA rules are regularly deactivated in your organization."],"from":"now-360s","rule_id":"13495726-cb43-4244-8359-40d2cc561caa","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://help.okta.com/en/prod/Content/Topics/Security/Security_Policies.htm","https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:policy.rule.deactivate","filters":[],"throttle":"no_actions","actions":[]}
