{"id":"d6457d90-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.991Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.916Z","created_by":"admin","name":"[GD] UAC Bypass Attempt with IEditionUpgradeManager Elevated COM Interface","tags":["Elastic","Host","Privilege Escalation","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies attempts to bypass User Account Control (UAC) by abusing an elevated COM Interface to launch a rogue Windows ClipUp program. Attackers may attempt to bypass UAC to stealthily execute code with elevated permissions.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"6b8f77e3-036c-4c33-b70a-9ac70941b3ad","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1548/","name":"Abuse Elevation Control Mechanism","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1548/002/","name":"Bypass User Access Control","id":"T1548.002"}],"id":"T1548"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0004/","name":"Privilege Escalation","id":"TA0004"}}],"to":"now","references":["https://github.com/hfiref0x/UACME"],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and process.name : \"Clipup.exe\" and\n  not process.executable : \"C:\\\\Windows\\\\System32\\\\ClipUp.exe\" and process.parent.name : \"dllhost.exe\" and\n  /* CLSID of the Elevated COM Interface IEditionUpgradeManager */\n  process.parent.args : \"/Processid:{BD54C901-076B-434E-B6C7-17C531F4AB41}\"\n","filters":[],"throttle":"no_actions","actions":[]}
