{"id":"d3da7101-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:47.218Z","updated_by":"admin","created_at":"2021-09-22T15:57:46.906Z","created_by":"admin","name":"[GD] UAC Bypass via ICMLuaUtil Elevated COM Interface","tags":["Elastic","Host","Privilege Escalation","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Identifies User Account Control (UAC) bypass attempts via the ICMLuaUtil Elevated COM interface. Attackers may attempt to bypass UAC to stealthily execute code with elevated permissions.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-540s","rule_id":"5212a650-773d-494b-ad71-23041b550b7c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1548/","name":"Abuse Elevation Control Mechanism","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1548/002/","name":"Bypass User Access Control","id":"T1548.002"}],"id":"T1548"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0004/","name":"Privilege Escalation","id":"TA0004"}}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"process where event.type in (\"start\", \"process_started\") and\n process.parent.name == \"dllhost.exe\" and\n process.parent.args in (\"/Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}\", \"/Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}\") and\n process.pe.original_file_name != \"WerFault.exe\"\n","filters":[],"throttle":"no_actions","actions":[]}
