{"id":"d64815a0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.279Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.934Z","created_by":"admin","name":"[GD] AWS Access Secret in Secrets Manager","tags":["AWS","Cloud","Continuous Monitoring","Data Protection","Elastic","SecOps"],"interval":"10m","enabled":false,"description":"An adversary may attempt to access the secrets in secrets manager to steal certificates, credentials, or other sensitive material","risk_score":73,"severity":"high","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Nick Jones","Elastic"],"false_positives":["Verify whether the user identity, user agent, and/or hostname should be using GetSecretString API for the specified SecretId. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"7d338cf8-9054-4360-9fa6-c29d39b49a74","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1528/","name":"Steal Application Access Token","subtechnique":[],"id":"T1528"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006/","name":"Credential Access","id":"TA0006"}}],"to":"now","references":["https://docs.aws.amazon.com/secretsmanager/latest/apireference/API_GetSecretValue.html","http://detectioninthe.cloud/credential_access/access_secret_in_secrets_manager/"],"version":5,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-config-*","aws-cloudtrail-*"],"query":"event.dataset:aws.cloudtrail and event.provider:secretsmanager.amazonaws.com and event.action:GetSecretValue","filters":[],"throttle":"no_actions","actions":[]}
