{"id":"d8320b50-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.625Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.951Z","created_by":"admin","name":"[GD] Modification or Removal of an Okta Application Sign-On Policy","tags":["Continuous Monitoring","Elastic","Identity","Identity and Access","Okta","SecOps"],"interval":"5m","enabled":false,"description":"Detects attempts to modify or delete a sign on policy for an Okta application. An adversary may attempt to modify or delete the sign on policy for an Okta application in order to remove or weaken an organization's security controls.","risk_score":47,"severity":"medium","note":"The Okta Fleet integration or Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"1m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Consider adding exceptions to this rule to filter false positives if sign on policies for Okta applications are regularly modified or deleted in your organization."],"from":"now-360s","rule_id":"bf5a2045-2a50-440d-9218-e6ee9cc75bfa","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://help.okta.com/en/prod/Content/Topics/Security/App_Based_Signon.htm","https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/"],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.dataset:okta.system and event.action:(application.policy.sign_on.update or application.policy.sign_on.rule.delete)","filters":[],"throttle":"no_actions","actions":[]}
