{"id":"d82a1c10-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:01:21.444Z","updated_by":"admin","created_at":"2021-09-22T15:57:53.948Z","created_by":"admin","name":"[GD] AWS EC2 Encryption Disabled","tags":["AWS","Cloud","Continuous Monitoring","Data Protection","Elastic","SecOps"],"interval":"10m","enabled":false,"description":"Identifies disabling of Amazon Elastic Block Store (EBS) encryption by default in the current region. Disabling encryption by default does not change the encryption status of your existing volumes.","risk_score":47,"severity":"medium","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Disabling encryption may be done by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Disabling encryption by unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"9b550717-aeba-4c56-a5b4-4f61818e14c9","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1565/","name":"Data Manipulation","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1565/001/","name":"Stored Data Manipulation","id":"T1565.001"}],"id":"T1565"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0040/","name":"Impact","id":"TA0040"}}],"to":"now","references":["https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/EBSEncryption.html","https://awscli.amazonaws.com/v2/documentation/api/latest/reference/ec2/disable-ebs-encryption-by-default.html","https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_DisableEbsEncryptionByDefault.html"],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-cloudtrail-*","aws-config-*"],"query":"event.action:DisableEbsEncryptionByDefault and event.dataset:aws.cloudtrail and event.provider:ec2.amazonaws.com and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
