{"id":"eab84400-5dae-11ec-ad47-191e7283e0c2","updated_at":"2022-03-21T22:35:55.323Z","updated_by":"jprentice1@godaddy.com","created_at":"2021-12-15T13:57:19.305Z","created_by":"admin","name":"[GD] Windows - Bad AD Tools","tags":["GD","Windows"],"interval":"1h","enabled":true,"description":"Converted from Splunk rule with the same name","risk_score":73,"severity":"high","license":"","output_index":".siem-signals-default","meta":{"from":"10m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-4200s","rule_id":"681b053c-53ba-4b1e-9e77-0a460c2680cd","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":22,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:windows-*"],"query":"((winlog.event_id: \"4648\" OR winlog.event_id: \"4688\") AND (event.original: *passwordcontrol.exe* OR event.original: *stuc.exe* OR event.original: *Hyena_x64*)) OR (winlog.event_id: \"4104\" AND (event.original: *DomainPasswordSpray* OR event.original: *dafthack*))","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":true,"type":"phrases","params":["4104","4648","4688"],"key":"event.code"},"query":{"bool":{"should":[{"match_phrase":{"event.code":"4104"}},{"match_phrase":{"event.code":"4648"}},{"match_phrase":{"event.code":"4688"}}],"minimum_should_match":1}}},{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":true,"type":"custom","value":"{\"bool\":{\"filter\":[{\"query_string\":{\"query\":\"(*passwordcontrol.exe) OR (*stuc.exe) OR (*Hyena_x64*) OR (*DomainPasswordSpray*) OR (*dafthack*)\",\"default_field\":\"process.executable\"}}]}}","key":"query"},"query":{"bool":{"filter":[{"query_string":{"query":"(*passwordcontrol.exe) OR (*stuc.exe) OR (*Hyena_x64*) OR (*DomainPasswordSpray*) OR (*dafthack*)","default_field":"process.executable"}}]}}}],"throttle":"rule","actions":[{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"Windows - Bad AD Tools\",\n  \"assignment_group\": \"OPS-GCSO\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \"See following Info:\\n{{#context.alerts}}\\n@timestamp: {{signal.original_time}}\\nComputer: {{winlog.computer_name}}\\nsubject_user_name: {{winlog.event_data.SubjectUserName}}\\ntarget_user_name: {{winlog.event_data.TargetUserName}}\\nprocess: {{process.name}}\\naction: {{event.action}}\\n{{/context.alerts}}\\n\\nThis panel is monitoring for instances of known-bad AD tools being used within our environment. Because this is a key indicator from our persistent social engineerng actor any new values present in this panel require an immediate call-out.\\n \\n{{context.results_link}}\",\n  \"priority\": \"1\",\n  \"severity\": \"2\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"},{"group":"default","id":"elastic-cloud-email","params":{"subject":"Elastic Alert: {{context.rule.name}}","to":["gcso@godaddy.com"],"message":"Rule {{context.rule.name}} generated {{state.signals_count}} alerts.\n\nLink to results: {{context.results_link}}"},"action_type_id":".email"},{"group":"default","id":"45e4ab50-9a83-11ec-b095-87bc28af8de9","params":{"message":"Your *{{context.rule.name}}* alert matched {{state.signals_count}} events.\n\n{{#context.alerts}}\nResult: ```{{event.original}}```\n\n{{/context.alerts}}"},"action_type_id":".slack"}]}
