{"id":"d64815a1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:33.805Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.923Z","created_by":"admin","name":"[GD] AWS CloudTrail Log Created","tags":["AWS","Cloud","Continuous Monitoring","Elastic","Log Auditing","SecOps"],"interval":"10m","enabled":false,"description":"Identifies the creation of an AWS log trail that specifies the settings for delivery of log data.","risk_score":21,"severity":"low","note":"The AWS Filebeat module must be enabled to use this rule.","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"50m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Trail creations may be made by a system or network administrator. Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. Trail creations from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."],"from":"now-3600s","rule_id":"90056afa-0424-4260-9c13-84aeb859620e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1530/","name":"Data from Cloud Storage Object","subtechnique":[],"id":"T1530"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0009/","name":"Collection","id":"TA0009"}}],"to":"now","references":["https://docs.aws.amazon.com/awscloudtrail/latest/APIReference/API_CreateTrail.html","https://awscli.amazonaws.com/v2/documentation/api/latest/reference/cloudtrail/create-trail.html"],"version":5,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["aws-cloudtrail-*","aws-config-*"],"query":"event.action:CreateTrail and event.dataset:aws.cloudtrail and event.provider:cloudtrail.amazonaws.com and event.outcome:success","filters":[],"throttle":"no_actions","actions":[]}
