{"id":"d645cbb0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T16:00:34.027Z","updated_by":"admin","created_at":"2021-09-22T15:57:50.918Z","created_by":"admin","name":"[GD] File and Directory Discovery","tags":["Discovery","Elastic","Host","Threat Detection","Windows"],"interval":"5m","enabled":false,"description":"Enumeration of files and directories using built-in tools. Adversaries may use the information discovered to plan follow-on activity.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","meta":{"from":"4m"},"timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Enumeration of files and directories may not be inherently malicious and noise may come from scripts, automation tools, or normal command line usage. It's important to baseline your environment to determine the amount of expected noise and exclude any known FP's from the rule."],"from":"now-540s","rule_id":"4a67e246-b5e2-4043-b4fb-fb9f39f60d3e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1083/","name":"File and Directory Discovery","subtechnique":[],"id":"T1083"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0007/","name":"Discovery","id":"TA0007"}}],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["windows-*"],"query":"sequence by agent.id, user.name with maxspan=1m\n[process where event.type in (\"start\", \"process_started\") and\n  ((process.name : \"cmd.exe\" or process.pe.original_file_name == \"Cmd.Exe\") and process.args : \"dir\") or\n    process.name : \"tree.com\"]\n[process where event.type in (\"start\", \"process_started\") and\n  ((process.name : \"cmd.exe\" or process.pe.original_file_name == \"Cmd.Exe\") and process.args : \"dir\") or\n    process.name : \"tree.com\"]\n[process where event.type in (\"start\", \"process_started\") and\n  ((process.name : \"cmd.exe\" or process.pe.original_file_name == \"Cmd.Exe\") and process.args : \"dir\") or\n    process.name : \"tree.com\"]\n","filters":[],"throttle":"no_actions","actions":[]}
