{"id":"6dc0a350-9a82-11ec-b59d-e77f2674f157","updated_at":"2022-04-06T17:57:37.325Z","updated_by":"schoi@godaddy.com","created_at":"2022-03-02T23:42:32.835Z","created_by":"schoi@godaddy.com","name":"ASM Honey Token Alert","tags":[],"interval":"1h","enabled":true,"description":"Honey token alert across regular/pci/registry org secretsmanager \"DontReadMe\" secret access.","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"15m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-4500s","rule_id":"94304468-9f9d-4984-b0c5-0ab7cabd927d","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":15,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:aws-cloudtrail-*","*:pci-aws-cloudtrail-*","*:registry-aws-cloudtrail-*"],"query":"event.provider: \"secretsmanager.amazonaws.com\" AND aws.cloudtrail.request_parameters: *DontReadMe*","filters":[{"meta":{"type":"phrases","key":"event.action","params":["GetSecretValue","DeleteSecret"],"alias":null,"negate":false,"disabled":false},"query":{"bool":{"should":[{"match_phrase":{"event.action":"GetSecretValue"}},{"match_phrase":{"event.action":"DeleteSecret"}}],"minimum_should_match":1}},"$state":{"store":"appState"}},{"meta":{"alias":null,"negate":true,"disabled":false,"type":"phrase","key":"user.name","params":{"query":"AccountAutomationServiceRole"}},"query":{"match_phrase":{"user.name":"AccountAutomationServiceRole"}},"$state":{"store":"appState"}}],"throttle":"rule","actions":[{"group":"default","id":"3d244760-9a7d-11ec-b095-87bc28af8de9","params":{"message":":honey_pot: ASM Honey Token Alert\n\nAlert: *{{context.rule.name}}* with *{{state.signals_count}}* events.\n\n```\n{{#context.alerts}}\nTime: {{signal.original_time}}\nActor: {{aws.cloudtrail.user_identity.arn}}\nEnvironment: {{environment}}\nEventName: {{event.action}}\nOutcome: {{event.outcome}}\nRegion: {{cloud.region}}\nSecretName: {{aws.cloudtrail.request_parameters}}\nAccountId: {{cloud.account.id}}\nLink: {{context.results_link}}\n---\n{{/context.alerts}}\n```"},"action_type_id":".slack"},{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"Elastic Test - ASM Honey Token Alert\",\n  \"assignment_group\": \"ENG-Product Security\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \":honey_pot: ASM Honey Token Alert\\n\\nAlert: *{{context.rule.name}}* with *{{state.signals_count}}* events.\\n\\n```\\n{{#context.alerts}}\\nTime: {{signal.original_time}}\\nActor: {{aws.cloudtrail.user_identity.arn}}\\nEnvironment: {{environment}}\\nEventName: {{event.action}}\\nOutcome: {{event.outcome}}\\nRegion: {{cloud.region}}\\nSecretName: {{aws.cloudtrail.request_parameters}}\\nAccountId: {{cloud.account.id}}\\nLink: {{context.results_link}}\\n---\\n{{/context.alerts}}\\n```\",\n  \"priority\": \"5\",\n  \"severity\": \"5\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"}]}
