{"id":"cd4a24c1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:34.875Z","updated_by":"admin","created_at":"2021-09-22T15:57:34.875Z","created_by":"admin","name":"Auditd Login Attempt at Forbidden Time [Duplicate]","tags":["Elastic","Host","Initial Access","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies that a login attempt occurred at a forbidden time.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-6m","rule_id":"489c6cb0-b8ee-4fc9-98ea-ec8f489cba24","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/"}]}],"to":"now","references":["https://github.com/linux-pam/linux-pam/blob/aac5a8fdc4aa3f7e56335a6343774cc1b63b408d/modules/pam_time/pam_time.c#L666"],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*"],"query":"event.module:auditd and event.action:\"attempted-log-in-during-unusual-hour-to\"","throttle":"no_actions","actions":[]}
