{"id":"cf8b3b21-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.738Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.738Z","created_by":"admin","name":"Auditd Max Failed Login Attempts [Duplicate]","tags":["Elastic","Host","Initial Access","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies that the maximum number of failed login attempts has been reached for a user.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-6m","rule_id":"d6cebd1e-70b3-48c9-b66c-97750e6d9040","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/"}]}],"to":"now","references":["https://github.com/linux-pam/linux-pam/blob/0adbaeb273da1d45213134aa271e95987103281c/modules/pam_faillock/pam_faillock.c#L574"],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*"],"query":"event.module:auditd and event.action:\"failed-log-in-too-many-times-to\"","throttle":"no_actions","actions":[]}
