{"id":"cf8a9ee0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.666Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.666Z","created_by":"admin","name":"Auditd Login from Forbidden Location [Duplicate]","tags":["Elastic","Host","Initial Access","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies that a login attempt has happened from a forbidden location.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-6m","rule_id":"e680864b-4539-4f5a-8e81-b0da2ccffd79","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/"}]}],"to":"now","references":["https://github.com/linux-pam/linux-pam/blob/aac5a8fdc4aa3f7e56335a6343774cc1b63b408d/modules/pam_access/pam_access.c#L412"],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*"],"query":"event.module:auditd and event.action:\"attempted-log-in-from-unusual-place-to\"","throttle":"no_actions","actions":[]}
