{"id":"cf8d5e00-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.732Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.732Z","created_by":"admin","name":"Base64 Encoding-Decoding Activity [Duplicate]","tags":["Defense Evasion","Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Adversaries may encode/decode data in an attempt to evade detection by host- or network-based security controls.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Automated tools such as Jenkins may encode or decode files as part of their normal behavior. These events can be filtered by the process executable or username values."],"from":"now-9m","rule_id":"8f58be12-6f56-4d54-bdf4-4f24225fa31f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1140","name":"Deobfuscate/Decode Files or Information","reference":"https://attack.mitre.org/techniques/T1140/"},{"id":"T1027","name":"Obfuscated Files or Information","reference":"https://attack.mitre.org/techniques/T1027/"}]}],"to":"now","references":[],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.name:(base64 or base64plain or base64url or base64mime or base64pem)","throttle":"no_actions","actions":[]}
