{"id":"cf891841-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.661Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.661Z","created_by":"admin","name":"Bash Shell Profile Modification [Duplicate]","tags":["Elastic","Host","Linux","macOS","Persistence","Threat Detection"],"interval":"5m","enabled":false,"description":"Both ~/.bash_profile and ~/.bashrc are files containing shell commands that are run when Bash is invoked. These files are executed in a user's context, either interactively or non-interactively, when a user logs in so that their environment is set correctly. Adversaries may abuse this to establish persistence by executing malicious content triggered by a user’s shell.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Changes to the Shell Profile tend to be noisy, a tuning per your environment will be required."],"from":"now-9m","rule_id":"896f09d1-42fc-4c1a-8dae-4057488abde5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546/","subtechnique":[{"id":"T1546.004","name":".bash_profile and .bashrc","reference":"https://attack.mitre.org/techniques/T1546/004/"}]}]}],"to":"now","references":["https://www.anomali.com/blog/pulling-linux-rabbit-rabbot-malware-out-of-a-hat"],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["logs-endpoint.events.*","auditbeat-*"],"query":"event.category:file and event.type:change and process.name:(* and not (sudo or vim or zsh or env or nano or bash or Terminal or xpcproxy or login or cat or cp or launchctl or java)) and not process.executable:(/Applications/* or /private/var/folders/* or /usr/local/*) and file.path:(/private/etc/rc.local or /etc/rc.local or /home/*/.profile or /home/*/.profile1 or /home/*/.bash_profile or /home/*/.bash_profile1 or /home/*/.bashrc or /Users/*/.bash_profile or /Users/*/.zshenv)","throttle":"no_actions","actions":[]}
