{"id":"cd4a99f1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:11.932Z","updated_by":"admin","created_at":"2021-09-22T15:57:35.846Z","created_by":"admin","name":"Carbon Black: Execution block (unapproved file)","tags":["Carbon Black","GD","POC"],"interval":"5m","enabled":false,"description":"This rules triggers when Carbon Black detects an Execution block (unapproved file) event.","risk_score":47,"severity":"medium","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://cbbf317cf62e4dd9b9913c1cc96ca394.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"timestamp_override":"event.ingested","author":[],"false_positives":[],"from":"now-360s","rule_id":"546a136f-5644-4fa5-8c3b-ca80b7f71475","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["carbon-black-*"],"query":"rule.description : \"Execution block (still analyzing)\" or rule.description : \"Execution block (unapproved file)\"","filters":[],"throttle":"no_actions","actions":[]}
