{"id":"bd7b6050-aef6-11ec-b058-3bdfa1ca61dc","updated_at":"2022-04-04T17:11:59.362Z","updated_by":"jprentice1@godaddy.com","created_at":"2022-03-29T00:25:31.155Z","created_by":"jprentice1@godaddy.com","name":"Connector Alerting - SNOW SIR Webhook Failures","tags":["godaddy","alerting"],"interval":"1m","enabled":true,"description":"This rule notifies all relevant teams when the SNOW SIR POST Webhook connector has failed to create a ticket for an alert.","risk_score":99,"severity":"critical","license":"","output_index":".siem-signals-default","meta":{"from":"10m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-660s","rule_id":"d16eb402-4350-468f-8b95-e8b178bccd10","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":9,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":[".kibana-event-log-*"],"query":"message : *SNOW Prod SIR POST Webhook","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrase","params":{"query":"failure"},"key":"event.outcome"},"query":{"match_phrase":{"event.outcome":"failure"}}},{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrase","params":{"query":"actions"},"key":"event.provider"},"query":{"match_phrase":{"event.provider":"actions"}}}],"throttle":"rule","actions":[{"group":"default","id":"elastic-cloud-email","params":{"subject":"{{context.rule.name}}","to":["productsecurity@godaddy.com","clopez1@godaddy.com","IR@godaddy.com","gcso@godaddy.com"],"message":"{{context.rule.name}}\n\n---\n\nThe SNOW SIR Webhook has failed to run {{state.signals_count}} time(s).\n\nPlease see the following details for the event(s):\n\n{{#context.alerts}}\n@timestamp: {{signal.original_time}}\n\nmessage: {{message}\n\nerror.message: {{error.message}}\n\n{{/context.alerts}}\n---\n\nLink to results dashboard: https://security-prod.kibana.int.gdcorp.tools/app/dashboards#/view/e81c47a0-b209-11ec-b59d-e77f2674f157?_g=(filters%3A!()%2CrefreshInterval%3A(pause%3A!t%2Cvalue%3A0)%2Ctime%3A(from%3Anow-7d%2Fd%2Cto%3Anow))"},"action_type_id":".email"},{"group":"default","id":"3d244760-9a7d-11ec-b095-87bc28af8de9","params":{"message":":alert_red: {{context.rule.name}} :alert_red:\n\nThe *SNOW SIR Webhook* has failed to run *{{state.signals_count}}* time(s).\n\nPlease see the following details for the event(s):\n\n{{#context.alerts}}\n```\n@timestamp: {{signal.original_time}}\n\nmessage: {{message}\n\nerror.message: {{error.message}}\n\n```\n{{/context.alerts}}\n\nLink to results dashboard: https://security-prod.kibana.int.gdcorp.tools/app/dashboards#/view/e81c47a0-b209-11ec-b59d-e77f2674f157?_g=(filters%3A!()%2CrefreshInterval%3A(pause%3A!t%2Cvalue%3A0)%2Ctime%3A(from%3Anow-7d%2Fd%2Cto%3Anow))"},"action_type_id":".slack"}]}
