{"id":"cf8bb051-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.696Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.696Z","created_by":"admin","name":"Creation of Hidden Files and Directories [Duplicate]","tags":["Defense Evasion","Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Users can mark specific files as hidden simply by putting a \".\" as the first character in the file or folder name. Adversaries can use this to their advantage to hide files and folders on the system for persistence and defense evasion. This rule looks for hidden files or folders in common writable directories.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Certain tools may create hidden temporary files or directories upon installation or as part of their normal behavior. These events can be filtered by the process arguments, username, or process name values."],"from":"now-9m","rule_id":"d6feff96-f43f-4a38-8744-93808e08cddd","max_signals":33,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1564","name":"Hide Artifacts","reference":"https://attack.mitre.org/techniques/T1564/","subtechnique":[{"id":"T1564.001","name":"Hidden Files and Directories","reference":"https://attack.mitre.org/techniques/T1564/001/"}]}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[]}],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"lucene","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process AND event.type:(start or process_started) AND process.working_directory:(\"/tmp\" or \"/var/tmp\" or \"/dev/shm\") AND process.args:/\\.[a-zA-Z0-9_\\-][a-zA-Z0-9_\\-\\.]{1,254}/ AND NOT process.name:(ls or find)","throttle":"no_actions","actions":[]}
