{"id":"cd49fdb1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:34.901Z","updated_by":"admin","created_at":"2021-09-22T15:57:34.901Z","created_by":"admin","name":"Enumeration of Kernel Modules [Duplicate]","tags":["Discovery","Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Loadable Kernel Modules (or LKMs) are pieces of code that can be loaded and unloaded into the kernel upon demand. They extend the functionality of the kernel without the need to reboot the system. This identifies attempts to enumerate information about a kernel module.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Security tools and device drivers may run these programs in order to enumerate kernel modules. Use of these programs by ordinary users is uncommon. These can be exempted by process name or username."],"from":"now-9m","rule_id":"f7e0da34-661f-487a-bd6f-a221b57c0de4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1082","name":"System Information Discovery","reference":"https://attack.mitre.org/techniques/T1082/"}]}],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.args:(kmod and list and sudo or sudo and (depmod or lsmod or modinfo))","throttle":"no_actions","actions":[]}
