{"id":"cd49af91-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:34.865Z","updated_by":"admin","created_at":"2021-09-22T15:57:34.865Z","created_by":"admin","name":"Hping Process Activity [Duplicate]","tags":["Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Hping ran on a Linux host. Hping is a FOSS command-line packet analyzer and has the ability to construct network packets for a wide variety of network security testing applications, including scanning and firewall auditing.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Normal use of hping is uncommon apart from security testing and research. Use by non-security engineers is very uncommon."],"from":"now-9m","rule_id":"6f581410-9bf8-4fcb-baaf-74d8d72efe13","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://en.wikipedia.org/wiki/Hping"],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.name:(hping or hping2 or hping3)","throttle":"no_actions","actions":[]}
