{"id":"c1990500-99a4-11ec-ab18-0d51419cd75c","updated_at":"2022-03-04T20:34:22.753Z","updated_by":"jprentice1@godaddy.com","created_at":"2022-03-01T21:15:45.209Z","created_by":"admin","name":"IDS Alert - Top 10 IPs","tags":["GD","Security"],"interval":"24h","enabled":false,"description":"Opens a case daily with link to IDS dashboard. **Still need to schedule as daily action, with link to dashboard in webhook action**\nURL to IDS dashboard: https://827ebd6fd06146bea2d2ad3a453d7e43.vpce.gdw55e.elastic-cloud.com:9243/app/dashboards#/view/7b206310-5dfa-11ec-9d1e-5b56ec0d9762?_g=(filters:!(),query:(language:kuery,query:''))","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"144h","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-604800s","rule_id":"1868dc5a-690d-4645-a67c-f5db55473281","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":8,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["*:onprem-*"],"query":"","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrase","params":{"query":"SECURITY.GEN.ALL.IDS.PROD"},"key":"aws.fluent_data"},"query":{"match_phrase":{"aws.fluent_data":"SECURITY.GEN.ALL.IDS.PROD"}}}],"threshold":{"field":["aws.fluent_data"],"value":1,"cardinality":[]},"throttle":"rule","actions":[{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"Elastic Test - DSR - IDS Alerts Review - Top 10 IPs\",\n  \"assignment_group\": \"OPS-GCSO\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \"Daily Reminder: Review IDS Alerts Review - Top 10 IPs dashboard. \\nhttps://security-prod.kibana.int.gdcorp.tools/app/dashboards#/view/7b206310-5dfa-11ec-9d1e-5b56ec0d9762\",\n  \"priority\": \"4\",\n  \"severity\": \"2\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"}]}
