{"id":"cf8bfe71-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.730Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.730Z","created_by":"admin","name":"Interactive Terminal Spawned via Perl [Duplicate]","tags":["Elastic","Execution","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies when a terminal (tty) is spawned via Perl. Attackers may upgrade a simple reverse shell to a fully interactive tty after obtaining initial access to a host.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-9m","rule_id":"ed5ea643-415a-4405-aefa-3ebb06ed30ed","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/"}]}],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.name:perl and process.args:(\"exec \\\"/bin/sh\\\";\" or \"exec \\\"/bin/dash\\\";\" or \"exec \\\"/bin/bash\\\";\")","throttle":"no_actions","actions":[]}
