{"id":"07995e20-936e-11ec-b058-3bdfa1ca61dc","updated_at":"2022-03-21T22:35:40.281Z","updated_by":"jprentice1@godaddy.com","created_at":"2022-02-21T23:28:52.503Z","created_by":"jprentice1@godaddy.com","name":"IRT - Suspicious AWS IAM Events (Forensic Account)","tags":["GD","Security"],"interval":"1h","enabled":true,"description":"based on Splunk logic:\nindex=\"aws_cloudtrail\" (aws_account_id=197818030129 OR aws_account_id=883229650331 OR aws_account_id=332047608640) (app=\"iam.amazonaws.com\" (eventName=Add* OR eventName=Change* OR eventName=Create* OR eventName=Deactivate* OR eventName=Delete* OR eventName=Enable* OR eventName=Pass* OR eventName=Remove* OR eventName=Reset* OR eventName=Resync* OR eventName=SetSecurity* OR eventName=Update* OR eventName=Upload*)) NOT ((userName=GD-AWS-IAM-Resources-GDAWSServiceAccountDeployRole-* AND sourceIPAddress = cloudformation.amazonaws.com) OR (userName = AWSServiceRoleForTrustedAdvisor AND sourceIPAddress = trustedadvisor.amazonaws.com) OR (userName = ServiceCatalogLaunchConstraintRole AND sourceIPAddress = servicecatalog.amazonaws.com) OR (userName = AccountAutomationServiceRole AND sourceIPAddress = cloudformation.amazonaws.com) OR userName=SC-*-pp-*-LambdaExecutionRole-* OR userName=GD-AWS-IAM-Resources-GDAWSServiceAccountDeployRole-*)\n| fillnull value=\"-\"\n| rename errorCode as Status, environment as Environment, aws_account_id as AccountID, eventName as Event, userName as User, principalUser as PrincipalUser,sourceIPAddress as SourceIP","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"10m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-4200s","rule_id":"215d0b93-89d6-4eac-a811-bacae4c6315d","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":17,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:aws-cloudtrail-*"],"query":"NOT ((user.name: GD-AWS-IAM-Resources-GDAWSServiceAccountDeployRole-* AND source.address: cloudformation.amazonaws.com) OR (user.name: AWSServiceRoleForTrustedAdvisor AND source.address: trustedadvisor.amazonaws.com) OR (user.name: ServiceCatalogLaunchConstraintRole AND source.address: servicecatalog.amazonaws.com) OR (user.name: AccountAutomationServiceRole AND source.address: cloudformation.amazonaws.com) OR user.name: SC-*-pp-*-LambdaExecutionRole-* OR user.name: GD-AWS-IAM-Resources-GDAWSServiceAccountDeployRole-*)","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrases","params":["197818030129","883229650331","332047608640"],"key":"cloud.account.id"},"query":{"bool":{"should":[{"match_phrase":{"cloud.account.id":"197818030129"}},{"match_phrase":{"cloud.account.id":"883229650331"}},{"match_phrase":{"cloud.account.id":"332047608640"}}],"minimum_should_match":1}}},{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrase","params":{"query":"iam.amazonaws.com"},"key":"event.provider"},"query":{"match_phrase":{"event.provider":"iam.amazonaws.com"}}},{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"custom","value":"{\"bool\":{\"should\":[{\"wildcard\":{\"event.action\":{\"value\":\"Add*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Change*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Create*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Deactivate*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Delete*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Enable*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Pass*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Remove*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Reset*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Resync*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"SetSecurity*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Update*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Upload*\"}}}],\"minimum_should_match\":1}}","key":"query"},"query":{"bool":{"should":[{"wildcard":{"event.action":{"value":"Add*"}}},{"wildcard":{"event.action":{"value":"Change*"}}},{"wildcard":{"event.action":{"value":"Create*"}}},{"wildcard":{"event.action":{"value":"Deactivate*"}}},{"wildcard":{"event.action":{"value":"Delete*"}}},{"wildcard":{"event.action":{"value":"Enable*"}}},{"wildcard":{"event.action":{"value":"Pass*"}}},{"wildcard":{"event.action":{"value":"Remove*"}}},{"wildcard":{"event.action":{"value":"Reset*"}}},{"wildcard":{"event.action":{"value":"Resync*"}}},{"wildcard":{"event.action":{"value":"SetSecurity*"}}},{"wildcard":{"event.action":{"value":"Update*"}}},{"wildcard":{"event.action":{"value":"Upload*"}}}],"minimum_should_match":1}}}],"throttle":"rule","actions":[{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"Suspicious AWS IAM Events (Forensic Analysis Account)\",\n  \"assignment_group\": \"OPS-GCSO\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \"See following Info:\\nSuspicious AWS IAM Events (Forensic Analysis Account)\\n\\n{{#context.alerts}}\\n\\nError Code: {{aws.cloudtrail.error_code}}\\nEnvironment: {{environment}}\\nAccount ID: {{cloud.account.id}}\\nUserType: {{aws.cloudtrail.user_identity.type}}\\nUser/Role: {{user.name}}\\nPrincipal ID: {{user.id}}\\nEvent: {{event.action}}\\nsource.address: {{source.address}}\\n{{/context.alerts}}\\n\\nSee Process Here:\\nhttps://confluence.godaddy.com/pages/viewpage.action?pageId=255072051\",\n  \"priority\": \"1\",\n  \"severity\": \"2\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"},{"group":"default","id":"elastic-cloud-email","params":{"message":"The alert condition for '{{context.rule.name}}' was triggered.\n\nLink to results: {{context.results_link}}","subject":"Elastic Alert: {{context.rule.name}}","to":["clopez1@godaddy.com","jmayerpotts@godaddy.com"]},"action_type_id":".email"}]}
