{"id":"cd4c2090-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-12-17T12:39:00.086Z","updated_by":"admin","created_at":"2021-09-22T15:57:35.843Z","created_by":"admin","name":"Linux Brute Force or Password Spraying Attack","tags":["Linux","Continuos Monitoring","Identity","GD"],"interval":"5m","enabled":true,"description":"Detect password spraying attacks on Linux systems","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"2330fef9-f340-44b1-b042-b7a0979f06b7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1110","name":"Brute Force","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1110/003","name":"Password Spraying","id":"T1110.003"}],"id":"T1110"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0006","name":"Credential Access","id":"TA0006"}}],"to":"now","references":[],"version":10,"exceptions_list":[],"immutable":false,"type":"threshold","language":"kuery","index":["linux-secure-*"],"query":"event.outcome: failure and event.category: authentication and event.action: ssh_login","filters":[],"threshold":{"field":["source.ip"],"value":5,"cardinality":[]},"throttle":"no_actions","actions":[]}
