{"id":"cf8b6230-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.685Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.685Z","created_by":"admin","name":"Mknod Process Activity [Duplicate]","tags":["Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"The Linux mknod program is sometimes used in the command payload of a remote command injection (RCI) and other exploits. It is used to export a command shell when the traditional version of netcat is not available to the payload.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Mknod is a Linux system program. Some normal use of this program, at varying levels of frequency, may originate from scripts, automation tools, and frameworks. Usage by web servers is more likely to be suspicious."],"from":"now-9m","rule_id":"4c245f43-4621-447b-826b-ee08aa96e8f7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://web.archive.org/web/20191218024607/https://pen-testing.sans.org/blog/2013/05/06/netcat-without-e-no-problem/"],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.name:mknod","throttle":"no_actions","actions":[]}
