{"id":"cf8c4c91-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.707Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.707Z","created_by":"admin","name":"Modification of Standard Authentication Module or Configuration [Duplicate]","tags":["Credential Access","Elastic","Host","Linux","macOS","Persistence","Threat Detection"],"interval":"5m","enabled":false,"description":"Adversaries may modify the standard authentication module for persistence via patching the normal authorization process or modifying the login configuration to allow unauthorized access or elevate privileges.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Trusted system module updates or allowed Pluggable Authentication Module (PAM) daemon configuration changes."],"from":"now-9m","rule_id":"a3de9482-67a8-4b60-b0e6-312d092f33bd","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1556","name":"Modify Authentication Process","reference":"https://attack.mitre.org/techniques/T1556/"}]}],"to":"now","references":["https://github.com/zephrax/linux-pam-backdoor","https://github.com/eurialo/pambd","http://0x90909090.blogspot.com/2016/06/creating-backdoor-in-pam-in-5-line-of.html","https://www.trendmicro.com/en_us/research/19/i/skidmap-linux-malware-uses-rootkit-capabilities-to-hide-cryptocurrency-mining-payload.html"],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:file and event.type:change and (file.name:pam_*.so or file.path:(/etc/pam.d/* or /private/etc/pam.d/*)) and process.executable: (* and not ( /bin/yum or \"/usr/sbin/pam-auth-update\" or /usr/libexec/packagekitd or /usr/bin/dpkg or /usr/bin/vim or /usr/libexec/xpcproxy or /usr/bin/bsdtar or /usr/local/bin/brew ) )","throttle":"no_actions","actions":[]}
