{"id":"cf8a77d1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.664Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.664Z","created_by":"admin","name":"Modification of OpenSSH Binaries [Duplicate]","tags":["Credential Access","Elastic","Host","Linux","Persistence","Threat Detection"],"interval":"5m","enabled":false,"description":"Adversaries may modify SSH related binaries for persistence or credential access by patching sensitive functions to enable unauthorized access or by logging SSH credentials for exfiltration.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Trusted OpenSSH executable updates. It's recommended to verify the integrity of OpenSSH binary changes."],"from":"now-9m","rule_id":"69341e2a-6919-48a6-be96-a86392396c00","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1556","name":"Modify Authentication Process","reference":"https://attack.mitre.org/techniques/T1556/"}]}],"to":"now","references":["https://blog.angelalonso.es/2016/09/anatomy-of-real-linux-intrusion-part-ii.html"],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:file and event.type:change and process.name:* and (file.path:(/usr/sbin/sshd or /usr/bin/ssh or /usr/bin/sftp or /usr/bin/scp) or file.name:libkeyutils.so) and not process.executable:/usr/bin/dpkg","throttle":"no_actions","actions":[]}
