{"id":"cf8ce8d0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.723Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.723Z","created_by":"admin","name":"Network Sniffing via Tcpdump [Duplicate]","tags":["Credential Access","Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"The Tcpdump program ran on a Linux host. Tcpdump is a network monitoring or packet sniffing tool that can be used to capture insecure credentials or data in motion. Sniffing can also be used to discover details of network services as a prelude to lateral movement or defense evasion.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Some normal use of this command may originate from server or network administrators engaged in network troubleshooting."],"from":"now-9m","rule_id":"48edae0f-8827-4b91-8970-cad424d6f5ce","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1040","name":"Network Sniffing","reference":"https://attack.mitre.org/techniques/T1040/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1040","name":"Network Sniffing","reference":"https://attack.mitre.org/techniques/T1040/"}]}],"to":"now","references":[],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.name:tcpdump","throttle":"no_actions","actions":[]}
