{"id":"02ab14d0-5151-11ec-9cfc-af15db683ef5","updated_at":"2022-03-21T22:28:32.196Z","updated_by":"jprentice1@godaddy.com","created_at":"2021-11-29T20:14:52.779Z","created_by":"admin","name":"Okta - Admin App Access","tags":["GD","Okta"],"interval":"1h","enabled":true,"description":"User has accessed Admin Application","risk_score":47,"severity":"medium","license":"","output_index":".siem-signals-default","meta":{"from":"10m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-4200s","rule_id":"412b18a2-a81f-42b3-8e1a-12cbe7d66b9e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":21,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:okta-*"],"query":"okta.display_message: \"User accessing Okta admin app\" ","filters":[{"$state":{"store":"appState"},"meta":{"negate":true,"alias":null,"disabled":false,"type":"phrases","params":["system@okta.com"],"key":"okta.actor.alternate_id"},"query":{"bool":{"should":[{"match_phrase":{"okta.actor.alternate_id":"system@okta.com"}}],"minimum_should_match":1}}}],"throttle":"1h","actions":[{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"Okta - Admin App Access\",\n  \"assignment_group\": \"OPS-GCSO\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \"To identify access to the okta admin app, if any user is deemed to have a valid reason using this admin app, please notify twhipple1@godaddy.com to get this rule tuned \\n \\n  See following Info:\\n  {{#context.alerts}}\\n  @timestamp: {{signal.original_time}}\\n  okta.actor.alternate_id: {{okta.actor.alternate_id}}\\n  okta.profile.title: {{okta.profile.title}}\\n  okta.profile.department: {{okta.profile.department}}\\n  {{/context.alerts}}\\n \\n{{context.results_link}}\",\n  \"priority\": \"3\",\n  \"severity\": \"3\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"}]}
