{"id":"cd4a4bd1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:11.875Z","updated_by":"admin","created_at":"2021-09-22T15:57:35.839Z","created_by":"admin","name":"Okta: New Device Enrolled","tags":["Okta","GD"],"interval":"5m","enabled":false,"description":"This rule triggers when a \"device.enrollment.create\" event is detection. This event is fired during Okta Device Authenticator enrollment when the device used to enroll is unknown. This can be used by any admin to monitor when a new device is registered successfully for Okta Verify. The user must have below the max allowed devices and a valid device state (not suspended or deactivated).The targets field contains key details of the enrolled device including name, status, serialNumber, imei, meid, osVersion, osPlatform. which may be useful for identifying the device, tracking which device platforms and OS versions that enrolled in Okta Device Authenticator.","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://cbbf317cf62e4dd9b9913c1cc96ca394.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"timestamp_override":"event.ingested","author":[],"false_positives":[],"from":"now-360s","rule_id":"2bb96c86-b70e-46a2-abf6-5eebae9d289f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://developer.okta.com/docs/reference/api/event-types/#catalog"],"version":4,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.action: \"system.email.new_device_notification.sent_message\"","filters":[],"throttle":"no_actions","actions":[]}
