{"id":"cd4a99f0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:59:11.877Z","updated_by":"admin","created_at":"2021-09-22T15:57:35.843Z","created_by":"admin","name":"Okta: New MFA Added for Account","tags":["Okta","GD"],"interval":"5m","enabled":false,"description":"This detection trigger for \"system.mfa.factor.activate\" Okta events.\n\nFrom Okta Documentation:\n\nActivate a new MFA factor. Can be used to identify when an admin has enabled a new factor for MFA. When fired the event will contain details of which factor is enabled.","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://cbbf317cf62e4dd9b9913c1cc96ca394.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"timestamp_override":"event.ingested","author":[],"false_positives":[],"from":"now-360s","rule_id":"39e0c131-ebd5-43bb-b3a5-c0e0db56d29f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://developer.okta.com/docs/reference/api/event-types/#catalog"],"version":4,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["okta-*"],"query":"event.action : \"user.mfa.factor.activate\" and okta.outcome.reason: User*factor","filters":[],"throttle":"no_actions","actions":[]}
