{"id":"cf8b6231-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.688Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.688Z","created_by":"admin","name":"Persistence via KDE AutoStart Script or Desktop File Modification [Duplicate]","tags":["Elastic","Host","Linux","Persistence","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies the creation or modification of a K Desktop Environment (KDE) AutoStart script or desktop file that will execute upon each user logon. Adversaries may abuse this method for persistence.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-9m","rule_id":"fd713891-ecea-4338-b3eb-1785b88e927a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547/"}]}],"to":"now","references":["https://userbase.kde.org/System_Settings/Autostart","https://www.amnesty.org/en/latest/research/2020/09/german-made-finspy-spyware-found-in-egypt-and-mac-and-linux-versions-revealed/","https://www.intezer.com/blog/research/operation-electrorat-attacker-creates-fake-companies-to-drain-your-crypto-wallets/"],"version":1,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["auditbeat-*","logs-endpoint.events.*"],"query":"file where event.type != \"deletion\" and\n  file.extension in (\"sh\", \"desktop\") and\n  file.path :\n    (\n      \"/home/*/.config/autostart/*\", \"/root/.config/autostart/*\",\n      \"/home/*/.kde/Autostart/*\", \"/root/.kde/Autostart/*\",\n      \"/home/*/.kde4/Autostart/*\", \"/root/.kde4/Autostart/*\",\n      \"/home/*/.kde/share/autostart/*\", \"/root/.kde/share/autostart/*\",\n      \"/home/*/.kde4/share/autostart/*\", \"/root/.kde4/share/autostart/*\",\n      \"/home/*/.local/share/autostart/*\", \"/root/.local/share/autostart/*\",\n      \"/home/*/.config/autostart-scripts/*\", \"/root/.config/autostart-scripts/*\",\n      \"/etc/xdg/autostart/*\", \"/usr/share/autostart/*\"\n    )\n","throttle":"no_actions","actions":[]}
