{"id":"29075bc0-6295-11ec-9d1e-5b56ec0d9762","updated_at":"2022-03-02T02:16:29.435Z","updated_by":"jprentice1@godaddy.com","created_at":"2021-12-21T19:35:32.863Z","created_by":"admin","name":"PKI System Logging Check","tags":[],"interval":"24h","enabled":true,"description":"Alerts if any *pki.gdg servers stop sending events for more than 24 hours","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"144h","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-604800s","rule_id":"a852526c-9d05-49bb-be68-8ab2c228acd8","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:host-tracker-*","host-tracker-*"],"query":"host.logging: false AND (((_index: GD-AWS-USA-GD-secesspmed-ESSP\\:host-tracker-onprem-10m OR _index: host-tracker-linux-*) AND aws.fluent_data: *.PKI.*) OR (_index: host-tracker-windows-* AND host.hostname: *pki*))","filters":[{"meta":{"alias":null,"negate":false,"disabled":false,"type":"exists","key":"host.hostname","value":"exists"},"query":{"exists":{"field":"host.hostname"}},"$state":{"store":"appState"}},{"query":{"range":{"@timestamp":{"gte":"now-3d"}}},"meta":{"type":"range","disabled":false,"negate":true,"alias":null,"key":"@timestamp","params":{"gte":"now-3d"}},"$state":{"store":"appState"}}],"throttle":"rule","actions":[{"group":"default","id":"elastic-cloud-email","params":{"message":"The alert condition for '{{context.rule.name}}' was triggered.\n\nLink to results:\n{{context.results_link}}","to":["productsecurity@godaddy.com"],"subject":"Elastic Alert: {{context.rule.name}}"},"action_type_id":".email"}]}
