{"id":"cd45b7f1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:34.849Z","updated_by":"admin","created_at":"2021-09-22T15:57:34.849Z","created_by":"admin","name":"Potential DNS Tunneling via Iodine [Duplicate]","tags":["Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Iodine is a tool for tunneling Internet protocol version 4 (IPV4) traffic over the DNS protocol to circumvent firewalls, network security groups, and network access lists while evading detection.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Normal use of Iodine is uncommon apart from security testing and research. Use by non-security engineers is very uncommon."],"from":"now-9m","rule_id":"6137f5e2-92f2-41fa-bba8-14e887504cbf","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://code.kryo.se/iodine/"],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.name:(iodine or iodined)","throttle":"no_actions","actions":[]}
