{"id":"cf8a9ee1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.669Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.669Z","created_by":"admin","name":"Potential Privilege Escalation via Sudoers File Modification [Duplicate]","tags":["Elastic","Host","Linux","macOS","Privilege Escalation","Threat Detection"],"interval":"5m","enabled":false,"description":"A sudoers file specifies the commands users or groups can run and from which terminals. Adversaries can take advantage of these configurations to execute commands as other users or spawn processes with higher privileges.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-9m","rule_id":"fa983b58-d4e2-4a26-9f17-c211fd8fd4b7","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548/","subtechnique":[{"id":"T1548.003","name":"Sudo and Sudo Caching","reference":"https://attack.mitre.org/techniques/T1548/003/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:start and process.args:(echo and *NOPASSWD*ALL*)","throttle":"no_actions","actions":[]}
