{"id":"cd4a24c0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:34.876Z","updated_by":"admin","created_at":"2021-09-22T15:57:34.876Z","created_by":"admin","name":"Potential Shell via Web Server [Duplicate]","tags":["Elastic","Host","Linux","Persistence","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies suspicious commands executed via a web server, which may suggest a vulnerability and remote shell access.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Network monitoring or management products may have a web server component that runs shell commands as part of normal behavior."],"from":"now-9m","rule_id":"96c24e95-bdb9-4da6-81f0-304f04015334","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1505","name":"Server Software Component","reference":"https://attack.mitre.org/techniques/T1505/","subtechnique":[{"id":"T1505.003","name":"Web Shell","reference":"https://attack.mitre.org/techniques/T1505/003/"}]}]}],"to":"now","references":["https://pentestlab.blog/tag/web-shell/"],"version":9,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.name:(bash or dash) and user.name:(apache or nginx or www or \"www-data\")","throttle":"no_actions","actions":[]}
