{"id":"cf8a50c0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.658Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.658Z","created_by":"admin","name":"Potential Persistence via Cron Job [Duplicate]","tags":["Elastic","Host","Linux","macOS","Persistence","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies the creation or execution of a cron job. Adversaries may abuse cron jobs to perform task scheduling for initial or recurring execution of malicious code.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Legitimate software or scripts using cron jobs for recurring tasks."],"from":"now-9m","rule_id":"5990288d-724d-45e7-9262-fa34508b6749","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1053","name":"Scheduled Task/Job","reference":"https://attack.mitre.org/techniques/T1053/","subtechnique":[{"id":"T1053.003","name":"Cron","reference":"https://attack.mitre.org/techniques/T1053/003/"}]}]}],"to":"now","references":["https://archive.f-secure.com/weblog/archives/00002576.html","https://ss64.com/osx/crontab.html"],"version":1,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started or info) and not user.name:root and ((process.name:crontab and not process.args:(\"-l\" or \"-r\" or \"-e\" or \"-help\" or \"-h\")) or (process.parent.name:cron and not process.name:\"running job\" and not process.executable:(/Applications/Docker.app/Contents/Resources/bin/docker or /usr/bin/killall or /usr/sbin/sendmail or /usr/bin/env or /usr/bin/timeshift or /bin/rm)))","throttle":"no_actions","actions":[]}
