{"id":"efcdbed0-5da8-11ec-ad47-191e7283e0c2","updated_at":"2022-03-21T22:35:18.230Z","updated_by":"jprentice1@godaddy.com","created_at":"2021-12-15T13:14:31.079Z","created_by":"admin","name":"Service-Now - HIPS","tags":["GD"],"interval":"1h","enabled":true,"description":"Converted from Splunk rule of the same name","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"10m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-4200s","rule_id":"0968aa07-8c67-456d-a794-2e8e96b300c3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":16,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:onprem-*"],"query":"not trendmicro.dvchost : P3VMC3* ","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrase","params":{"query":"DEEPSECURITY"},"key":"aws.fluent_tags"},"query":{"match_phrase":{"aws.fluent_tags":"DEEPSECURITY"}}},{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrases","params":["Delete","Quarantine"],"key":"trendmicro.act"},"query":{"bool":{"should":[{"match_phrase":{"trendmicro.act":"Delete"}},{"match_phrase":{"trendmicro.act":"Quarantine"}}],"minimum_should_match":1}}},{"$state":{"store":"appState"},"meta":{"negate":true,"alias":null,"disabled":false,"type":"custom","value":"{\"bool\":{\"should\":[{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"D:\\\\\\\\\\\\\\\\Content\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"E:\\\\\\\\\\\\\\\\IrisFiles\\\\\\\\\\\\\\\\CorpIrisAttachments\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"E:\\\\\\\\\\\\\\\\LegalDocs\\\\\\\\\\\\\\\\TempFilter\\\\\\\\\\\\\\\\*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"D:\\\\\\\\\\\\\\\\temp\\\\\\\\\\\\\\\\IIS Temporary Compressed Files\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"D:\\\\\\\\\\\\\\\\registrar server components\\\\\\\\\\\\\\\\Logs\\\\\\\\\\\\\\\\DBPEmailForwardingSvc\\\\\\\\\\\\\\\\*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"E:\\\\\\\\\\\\\\\\PleskVhosts\\\\\\\\\\\\\\\\*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"H:\\\\\\\\\\\\\\\\Hosting\\\\\\\\\\\\\\\\*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"D:\\\\\\\\\\\\\\\\Hosting\\\\\\\\\\\\\\\\*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"E:\\\\\\\\\\\\\\\\IrisFiles\\\\\\\\\\\\\\\\*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"E:\\\\\\\\\\\\\\\\System Volume Information\\\\\\\\\\\\\\\\*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"G:\\\\\\\\\\\\\\\\*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"*/var/chroot/home/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"*/opt/chroot/mount/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"*/var/chroot/var/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"*/mail/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"Z:/PleskVhosts/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"*/var/spool/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"*/public_html/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"*/php/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"*/tmp/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"*/home/*\"}}},{\"wildcard\":{\"trendmicro.filePath\":{\"value\":\"/dev/shm/*\"}}}],\"minimum_should_match\":1}}","key":"query"},"query":{"bool":{"should":[{"wildcard":{"trendmicro.filePath":{"value":"D:\\\\\\\\Content"}}},{"wildcard":{"trendmicro.filePath":{"value":"E:\\\\\\\\IrisFiles\\\\\\\\CorpIrisAttachments"}}},{"wildcard":{"trendmicro.filePath":{"value":"E:\\\\\\\\LegalDocs\\\\\\\\TempFilter\\\\\\\\*"}}},{"wildcard":{"trendmicro.filePath":{"value":"D:\\\\\\\\temp\\\\\\\\IIS Temporary Compressed Files"}}},{"wildcard":{"trendmicro.filePath":{"value":"D:\\\\\\\\registrar server components\\\\\\\\Logs\\\\\\\\DBPEmailForwardingSvc\\\\\\\\*"}}},{"wildcard":{"trendmicro.filePath":{"value":"E:\\\\\\\\PleskVhosts\\\\\\\\*"}}},{"wildcard":{"trendmicro.filePath":{"value":"H:\\\\\\\\Hosting\\\\\\\\*"}}},{"wildcard":{"trendmicro.filePath":{"value":"D:\\\\\\\\Hosting\\\\\\\\*"}}},{"wildcard":{"trendmicro.filePath":{"value":"E:\\\\\\\\IrisFiles\\\\\\\\*"}}},{"wildcard":{"trendmicro.filePath":{"value":"E:\\\\\\\\System Volume Information\\\\\\\\*"}}},{"wildcard":{"trendmicro.filePath":{"value":"G:\\\\\\\\*"}}},{"wildcard":{"trendmicro.filePath":{"value":"*/var/chroot/home/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"*/opt/chroot/mount/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"*/var/chroot/var/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"*/mail/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"Z:/PleskVhosts/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"*/var/spool/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"*/public_html/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"*/php/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"*/tmp/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"*/home/*"}}},{"wildcard":{"trendmicro.filePath":{"value":"/dev/shm/*"}}}],"minimum_should_match":1}}},{"$state":{"store":"appState"},"meta":{"negate":true,"alias":null,"disabled":false,"type":"custom","value":"{\"bool\":{\"should\":[{\"wildcard\":{\"trendmicro.trigger\":{\"value\":\"Cookie*\"}}},{\"wildcard\":{\"trendmicro.trigger\":{\"value\":\"*WEBSHELL*\"}}},{\"wildcard\":{\"trendmicro.trigger\":{\"value\":\"*CHOPPER*\"}}},{\"wildcard\":{\"trendmicro.trigger\":{\"value\":\"*SPAMBOT*\"}}},{\"wildcard\":{\"trendmicro.trigger\":{\"value\":\"*Adware*\"}}},{\"wildcard\":{\"trendmicro.trigger\":{\"value\":\"*PUA*\"}}}],\"minimum_should_match\":1}}","key":"query"},"query":{"bool":{"should":[{"wildcard":{"trendmicro.trigger":{"value":"Cookie*"}}},{"wildcard":{"trendmicro.trigger":{"value":"*WEBSHELL*"}}},{"wildcard":{"trendmicro.trigger":{"value":"*CHOPPER*"}}},{"wildcard":{"trendmicro.trigger":{"value":"*SPAMBOT*"}}},{"wildcard":{"trendmicro.trigger":{"value":"*Adware*"}}},{"wildcard":{"trendmicro.trigger":{"value":"*PUA*"}}}],"minimum_should_match":1}}}],"throttle":"rule","actions":[{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"HIPS Alert ({{state.signals_count}} alerts)\",\n  \"assignment_group\": \"OPS-GCSO\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \"Dashboard - https://security-prod.kibana.int.gdcorp.tools/app/dashboards#/view/796ccc90-51fa-11ec-9cfc-af15db683ef5\\nProcess - https://confluence.godaddy.com/display/IRKB/System+Activity+Investigations\\n\\n{{#context.alerts}}\\n@timestamp: {{signal.original_time}}\\nalert: {{trendmicro.trigger}}\\nInfected_Resource: NULL\\nmsg: {{trendmicro.msg}}\\nact: {{trendmicro.act}}\\ndvchost: {{trendmicro.dvchost}}\\n{{/context.alerts}}\\n\\nAlert Source: Service-Now - HIPS (Elastic)\",\n  \"priority\": \"3\",\n  \"severity\": \"3\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"}]}
