{"id":"cf8cc1c1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.737Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.737Z","created_by":"admin","name":"Socat Process Activity [Duplicate]","tags":["Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"A Socat process is running on a Linux host. Socat is often used as a persistence mechanism by exporting a reverse shell, or by serving a shell on a listening port. Socat is also sometimes used for lateral movement.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Socat is a dual-use tool that can be used for benign or malicious activity. Some normal use of this program, at varying levels of frequency, may originate from scripts, automation tools, and frameworks. Usage by web servers is more likely to be suspicious."],"from":"now-9m","rule_id":"fbbbdda8-be68-4cb1-97c3-8b32e3542ece","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://blog.ropnop.com/upgrading-simple-shells-to-fully-interactive-ttys/#method-2-using-socat"],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.name:socat and not process.args:-V","throttle":"no_actions","actions":[]}
