{"id":"cd460610-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:34.850Z","updated_by":"admin","created_at":"2021-09-22T15:57:34.850Z","created_by":"admin","name":"Strace Process Activity [Duplicate]","tags":["Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Strace runs in a privileged context and can be used to escape restrictive environments by instantiating a shell in order to elevate privileges or move laterally.","risk_score":21,"severity":"low","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Strace is a dual-use tool that can be used for benign or malicious activity. Some normal use of this command may originate from developers or SREs engaged in debugging or system call tracing."],"from":"now-9m","rule_id":"877a8909-14dd-4570-94a7-bfa00dd1b926","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://en.wikipedia.org/wiki/Strace"],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.name:strace","throttle":"no_actions","actions":[]}
