{"id":"99badb80-90d0-11ec-b59d-e77f2674f157","updated_at":"2022-03-21T22:23:04.438Z","updated_by":"jprentice1@godaddy.com","created_at":"2022-02-18T15:36:55.841Z","created_by":"admin","name":"Suspicious AWS IAM Events","tags":["GD","Security"],"interval":"1h","enabled":true,"description":"based on Splunk logic:\nindex=\"aws_cloudtrail\" (aws_account_id=539225272086 OR aws_account_id=763338924548 OR aws_account_id=745293682974) (app=\"iam.amazonaws.com\" (eventName=Add* OR eventName=Change* OR eventName=Create* OR eventName=Deactivate* OR eventName=Delete* OR eventName=Enable* OR eventName=Pass* OR eventName=Remove* OR eventName=Reset* OR eventName=Resync* OR eventName=SetSecurity* OR eventName=Update* OR eventName=Upload*)) NOT ((userName=GD-AWS-IAM-Resources-GDAWSServiceAccountDeployRole-* AND sourceIPAddress = cloudformation.amazonaws.com) OR (userName = AWSServiceRoleForTrustedAdvisor AND sourceIPAddress = trustedadvisor.amazonaws.com) OR (userName = ServiceCatalogLaunchConstraintRole AND sourceIPAddress = servicecatalog.amazonaws.com) OR (userName = AccountAutomationServiceRole AND sourceIPAddress = cloudformation.amazonaws.com) OR userName=SC-*-pp-*-LambdaExecutionRole-* OR userName=GD-AWS-IAM-Resources-GDAWSServiceAccountDeployRole-*)\n | fillnull value=\"-\"\n | rename errorCode as Status, environment as Environment, aws_account_id as AccountID, eventName as Event, userName as User, principalUser as PrincipalUser,sourceIPAddress as SourceIP\n | stats count by Status, Environment, AccountID, User, PrincipalUser, Event, SourceIP\n | sort by Environment, User","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"10m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-4200s","rule_id":"ad4df7ae-64c9-408f-96f8-f87260dad075","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":9,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:aws-cloudtrail-*"],"query":"NOT ((user.name: GD-AWS-IAM-Resources-GDAWSServiceAccountDeployRole-* AND source.address: cloudformation.amazonaws.com) OR (user.name: AWSServiceRoleForTrustedAdvisor AND source.address: trustedadvisor.amazonaws.com) OR (user.name: ServiceCatalogLaunchConstraintRole AND source.address: servicecatalog.amazonaws.com) OR (user.name: AccountAutomationServiceRole AND source.address: cloudformation.amazonaws.com) OR user.name: SC-*-pp-*-LambdaExecutionRole-* OR user.name: GD-AWS-IAM-Resources-GDAWSServiceAccountDeployRole-*)","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrases","params":["539225272086","763338924548","745293682974"],"key":"cloud.account.id"},"query":{"bool":{"should":[{"match_phrase":{"cloud.account.id":"539225272086"}},{"match_phrase":{"cloud.account.id":"763338924548"}},{"match_phrase":{"cloud.account.id":"745293682974"}}],"minimum_should_match":1}}},{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"phrase","params":{"query":"iam.amazonaws.com"},"key":"event.provider"},"query":{"match_phrase":{"event.provider":"iam.amazonaws.com"}}},{"$state":{"store":"appState"},"meta":{"negate":false,"alias":null,"disabled":false,"type":"custom","value":"{\"bool\":{\"should\":[{\"wildcard\":{\"event.action\":{\"value\":\"Add*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Change*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Create*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Deactivate*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Delete*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Enable*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Pass*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Remove*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Reset*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Resync*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"SetSecurity*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Update*\"}}},{\"wildcard\":{\"event.action\":{\"value\":\"Upload*\"}}}],\"minimum_should_match\":1}}","key":"query"},"query":{"bool":{"should":[{"wildcard":{"event.action":{"value":"Add*"}}},{"wildcard":{"event.action":{"value":"Change*"}}},{"wildcard":{"event.action":{"value":"Create*"}}},{"wildcard":{"event.action":{"value":"Deactivate*"}}},{"wildcard":{"event.action":{"value":"Delete*"}}},{"wildcard":{"event.action":{"value":"Enable*"}}},{"wildcard":{"event.action":{"value":"Pass*"}}},{"wildcard":{"event.action":{"value":"Remove*"}}},{"wildcard":{"event.action":{"value":"Reset*"}}},{"wildcard":{"event.action":{"value":"Resync*"}}},{"wildcard":{"event.action":{"value":"SetSecurity*"}}},{"wildcard":{"event.action":{"value":"Update*"}}},{"wildcard":{"event.action":{"value":"Upload*"}}}],"minimum_should_match":1}}}],"throttle":"rule","actions":[{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"Suspicious AWS IAM Events (Storage Account)\",\n  \"assignment_group\": \"OPS-GCSO\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \"See following Info:\\nSuspicious AWS IAM Events (Storage Account)\\n\\n{{#context.alerts}}\\nError Code: {{aws.cloudtrail.error_code}}\\nEnvironment: {{environment}}\\nAccount ID: {{cloud.account.id}}\\nUserType: {{aws.cloudtrail.user_identity.type}}\\nUser/Role: {{user.name}}\\nPrincipal ID: {{user.id}}\\nEvent: {{event.action}}\\nsource.address: {{source.address}}\\n{{/context.alerts}}\\n\\nSee Process Here:\\nhttps://confluence.godaddy.com/pages/viewpage.action?pageId=214401774\",\n  \"priority\": \"1\",\n  \"severity\": \"2\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"}]}
