{"id":"cf8aed00-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.671Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.671Z","created_by":"admin","name":"Suspicious JAR Child Process [Duplicate]","tags":["Elastic","Execution","Host","Linux","macOS","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies suspicious child processes of a Java Archive (JAR) file. JAR files may be used to deliver malware in order to evade detection.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-9m","rule_id":"9843f14d-f1dc-4f93-89f7-ac20c7945a01","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.007","name":"JavaScript/JScript","reference":"https://attack.mitre.org/techniques/T1059/007/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["auditbeat-*","logs-endpoint.events.*"],"query":"process where event.type in (\"start\", \"process_started\") and\n  process.parent.name : \"java\" and\n  process.name : (\"sh\", \"bash\", \"dash\", \"ksh\", \"tcsh\", \"zsh\", \"curl\", \"wget\") and\n  process.args : \"-jar\" and process.args : \"*.jar\" and\n  /* Add any FP's here */\n  not process.executable : (\"/Users/*/.sdkman/*\", \"/Library/Java/JavaVirtualMachines/*\") and\n  not process.args : (\"/usr/local/*\", \"/Users/*/github.com/*\", \"/Users/*/src/*\")\n","throttle":"no_actions","actions":[]}
