{"id":"cf8ac5f1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.668Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.668Z","created_by":"admin","name":"System Log File Deletion [Duplicate]","tags":["Defense Evasion","Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies the deletion of sensitive Linux system logs. This may indicate an attempt to evade detection or destroy forensic evidence on a system.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-9m","rule_id":"26502433-d474-4eef-8f7e-67156239272e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070/"}]}],"to":"now","references":["https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html"],"version":3,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["auditbeat-*","logs-endpoint.events.*"],"query":"file where event.type == \"deletion\" and \n  file.path : \n    (\n    \"/var/run/utmp\", \n    \"/var/log/wtmp\", \n    \"/var/log/btmp\", \n    \"/var/log/lastlog\", \n    \"/var/log/faillog\",\n    \"/var/log/syslog\", \n    \"/var/log/messages\", \n    \"/var/log/secure\", \n    \"/var/log/auth.log\"\n    )\n","throttle":"no_actions","actions":[]}
