{"id":"cf8a50c1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.663Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.663Z","created_by":"admin","name":"Tampering of Bash Command-Line History [Duplicate]","tags":["Defense Evasion","Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Adversaries may attempt to clear or disable the Bash command-line history in an attempt to evade detection or forensic investigations.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-9m","rule_id":"1470e6df-154d-4312-8d12-7b276e12e4fd","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070/","subtechnique":[{"id":"T1070.003","name":"Clear Command History","reference":"https://attack.mitre.org/techniques/T1070/003/"}]}]}],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["auditbeat-*","logs-endpoint.events.*"],"query":"process where event.type in (\"start\", \"process_started\") and\n (\n  (process.args : (\"rm\", \"echo\") and process.args : (\".bash_history\", \"/root/.bash_history\", \"/home/*/.bash_history\")) or\n  (process.name : \"history\" and process.args : \"-c\") or\n  (process.args : \"export\" and process.args : (\"HISTFILE=/dev/null\", \"HISTFILESIZE=0\")) or\n  (process.args : \"unset\" and process.args : \"HISTFILE\") or\n  (process.args : \"set\" and process.args : \"history\" and process.args : \"+o\")\n )\n","throttle":"no_actions","actions":[]}
