{"id":"386808a0-c58f-11ec-a104-0f9510a5035b","updated_at":"2022-04-28T18:55:47.579Z","updated_by":"clopez1@godaddy.com","created_at":"2022-04-26T18:32:26.446Z","created_by":"jprentice1@godaddy.com","name":"Tanium Alert - GoDaddy MWP SIR PHP Bad File Count on p3nlwpapp001","tags":["GD","Tanium"],"interval":"1h","enabled":true,"description":"Fires when the threshold count of matches for the Tanium question \"GoDaddy MWP SIR PHP Bad File Count on p3nlwpapp001\" is greater than 100","risk_score":47,"severity":"medium","license":"","output_index":".siem-signals-default","meta":{"from":"1h","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-7200s","rule_id":"1265ff14-4550-432e-a905-333d8e617c0c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":2,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:tanium-*"],"query":"tanium.GoDaddy-MWP-SIR0034749-Bad-File-Count: * AND tanium.GoDaddy-MWP-SIR0034749-Bad-File-Count > 100","filters":[],"throttle":"rule","actions":[{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"{{context.rule.name}}\",\n  \"assignment_group\": \"infosec_response\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \"The {{context.rule.name}} has triggered. Please follow the playbook here https://confluence.godaddy.com/display/IRKB/IRT+-+Tanium+-+PHP+Bad+File+Count+Threshold+reached++in+MWP.\\n\\n{{#context.alerts}}\\n@timestamp: {{signal.original_time}}\\nGoDaddy-MWP-SIR0034749-Bad-File-Count: {{tanium.GoDaddy-MWP-SIR0034749-Bad-File-Count}}\\n{{/context.alerts}}\\n\\nLink to results: {{context.results_link}}\",\n  \"priority\": \"3\",\n  \"severity\": \"3\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"},{"group":"default","id":"45e4ab50-9a83-11ec-b095-87bc28af8de9","params":{"message":"The {{context.rule.name}} has triggered. Please follow the playbook here https://confluence.godaddy.com/display/IRKB/IRT+-+Tanium+-+PHP+Bad+File+Count+Threshold+reached++in+MWP."},"action_type_id":".slack"}]}
