{"id":"cd45df00-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2022-02-23T16:12:39.695Z","updated_by":"admin","created_at":"2021-09-22T15:57:35.845Z","created_by":"admin","name":"Tanium Recorded Future Hash Threat Match","tags":["Tanium","GD"],"interval":"5m","enabled":false,"description":"Correlate Tanium process hashes with Recorded Future threat intelligence data.","risk_score":73,"severity":"high","license":"","output_index":".siem-signals-default","timeline_id":"11ac165d-d800-4290-9c70-cfb5c545f2c3","timeline_title":"Tanium Hash Indicator Match","meta":{"from":"6000h","kibana_siem_app_url":"https://cbbf317cf62e4dd9b9913c1cc96ca394.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"author":[],"false_positives":[],"from":"now-21600300s","rule_id":"a5d7e8f8-03fa-4e1d-8665-fc59f3a1f54f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"threat_match","language":"kuery","index":["*:tanium-*"],"query":"hash.md5: *","filters":[],"threat_filters":[],"threat_query":"rf.algorithm : MD5","threat_mapping":[{"entries":[{"field":"hash.md5","type":"mapping","value":"threatintel.indicator.file.hash.md5"}]}],"threat_language":"kuery","threat_index":["rf_hash_risklist"],"threat_indicator_path":"","throttle":"no_actions","actions":[]}
