{"id":"f64c2cf0-5917-11ec-8f3e-0bb4bad39cd8","updated_at":"2022-04-25T19:45:20.672Z","updated_by":"jprentice1@godaddy.com","created_at":"2021-12-09T17:46:40.171Z","created_by":"admin","name":"Tanium-Detect","tags":["GD","Tanium"],"interval":"1h","enabled":true,"description":"Based on Splunk rule. *Note* Splunk rule also filters on  (NOT \"SEC0129734\" NOT \"Suspicious PowerShell Command Line,Beta\"). The \"Suspicious PowerShell Command Line,Beta\" alert has since been tuned in Tanium, so it has been removed from the Elastic filters.\nCurrently, parsing is broken, so we are filtering for \"tanium-signal\" from the message field. This should be updated to the correct field once parsing is eventually fixed.","risk_score":21,"severity":"low","license":"","output_index":".siem-signals-default","meta":{"from":"10m","kibana_siem_app_url":"https://security-prod.kibana.int.gdcorp.tools/app/security"},"author":[],"false_positives":[],"from":"now-4200s","rule_id":"492393b8-dbbd-4068-b83d-38f3c3ee774a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":16,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["*:tanium-*"],"query":"message:\"tanium-signal\" and NOT message:\"SEC0129734\"","filters":[],"throttle":"rule","actions":[{"group":"default","id":"56fd1b40-5f85-11ec-9d1e-5b56ec0d9762","params":{"body":"{\n  \"short_description\": \"Elastic Test - Tanium-Detect ({{state.signals_count}} alerts)\",\n  \"assignment_group\": \"OPS-GCSO\",\n  \"category\": \"Unauthorized access\",\n  \"contact_type\": \"siem\",\n  \"description\": \"An event occurred with the following events:\\n\\n{{#context.alerts}}\\n@timestamp: {{signal.original_time}}\\nevent.original: {{event.original}}\\ntanium.question: N/A at the moment in Elastic\\ntanium.Computer-Name: N/A at the moment in Elastic\\n{{/context.alerts}}\\n\\nFor additional details, the alert can be viewed here:\\n{{context.results_link}}\",\n  \"priority\": \"3\",\n  \"severity\": \"3\",\n  \"state\": \"10\"\n}"},"action_type_id":".webhook"}]}
