{"id":"cd4a72e1-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:34.897Z","updated_by":"admin","created_at":"2021-09-22T15:57:34.897Z","created_by":"admin","name":"Timestomping using Touch Command [Duplicate]","tags":["Defense Evasion","Elastic","Host","Linux","macOS","Threat Detection"],"interval":"5m","enabled":false,"description":"Timestomping is an anti-forensics technique which is used to modify the timestamps of a file, often to mimic files that are in the same folder.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-9m","rule_id":"990c77fa-a910-4610-b14d-4f57df23b5bd","max_signals":33,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1070","name":"Indicator Removal on Host","reference":"https://attack.mitre.org/techniques/T1070/","subtechnique":[{"id":"T1070.006","name":"Timestomp","reference":"https://attack.mitre.org/techniques/T1070/006/"}]}]}],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"type":"eql","language":"eql","index":["auditbeat-*","logs-endpoint.events.*"],"query":"process where event.type in (\"start\", \"process_started\") and\n process.name : \"touch\" and process.args : (\"-r\", \"-t\", \"-a*\",\"-m*\")\n","throttle":"no_actions","actions":[]}
