{"id":"1a8e7340-5e84-11ec-913f-f3e6d4d708c3","updated_at":"2022-03-01T20:04:19.160Z","updated_by":"jprentice1@godaddy.com","created_at":"2021-12-16T15:23:22.192Z","created_by":"admin","name":"Trend Micro MD5 identified in tanium or recorded future","tags":["GD"],"interval":"30m","enabled":true,"description":"Currently only matches against Tanium md5s","risk_score":47,"severity":"medium","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://827ebd6fd06146bea2d2ad3a453d7e43.vpce.gdw55e.elastic-cloud.com:9243/app/security"},"author":[],"false_positives":[],"from":"now-1860s","rule_id":"00453c27-e4a6-4f02-9963-2d8ce0ab8203","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"type":"threat_match","language":"kuery","index":["*:onprem-*"],"query":"trendmicro.TrendMicroDsFileMD5 : * ","filters":[{"meta":{"alias":null,"negate":false,"disabled":false,"type":"phrase","key":"aws.fluent_tags","params":{"query":"DEEPSECURITY"}},"query":{"match_phrase":{"aws.fluent_tags":"DEEPSECURITY"}},"$state":{"store":"appState"}}],"threat_filters":[],"threat_query":"*","threat_mapping":[{"entries":[{"field":"trendmicro.TrendMicroDsFileMD5","type":"mapping","value":"tanium.match.properties.file.md5"}]}],"threat_language":"kuery","threat_index":["md5-list-tanium"],"threat_indicator_path":"","throttle":"no_actions","actions":[]}
