{"id":"cf8d36f0-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:38.727Z","updated_by":"admin","created_at":"2021-09-22T15:57:38.727Z","created_by":"admin","name":"Unusual Process Execution - Temp [Duplicate]","tags":["Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"Identifies processes running in a temporary folder. This is sometimes done by adversaries to hide malware.","risk_score":47,"severity":"medium","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Build systems, like Jenkins, may start processes in the `/tmp` directory. These can be exempted by name or by username."],"from":"now-9m","rule_id":"2b2facad-9e00-460d-a8d4-5102ddabd807","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":7,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.working_directory:/tmp","throttle":"no_actions","actions":[]}
