{"id":"cd4b8450-1bbd-11ec-be20-3f0a15bcc54c","updated_at":"2021-09-22T15:57:34.885Z","updated_by":"admin","created_at":"2021-09-22T15:57:34.885Z","created_by":"admin","name":"Virtual Machine Fingerprinting [Duplicate]","tags":["Discovery","Elastic","Host","Linux","Threat Detection"],"interval":"5m","enabled":false,"description":"An adversary may attempt to get detailed information about the operating system and hardware. This rule identifies common locations used to discover virtual machine hardware by a non-root user. This technique has been used by the Pupy RAT and other malware.","risk_score":73,"severity":"high","license":"Elastic License v2","output_index":".siem-signals-default","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":["Certain tools or automated software may enumerate hardware information. These tools can be exempted via user name or process arguments to eliminate potential noise."],"from":"now-9m","rule_id":"d84ec33c-76ee-4965-abc3-4753f94c72b2","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1082","name":"System Information Discovery","reference":"https://attack.mitre.org/techniques/T1082/"}]}],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["auditbeat-*","logs-endpoint.events.*"],"query":"event.category:process and event.type:(start or process_started) and process.args:(\"/sys/class/dmi/id/bios_version\" or \"/sys/class/dmi/id/product_name\" or \"/sys/class/dmi/id/chassis_vendor\" or \"/proc/scsi/scsi\" or \"/proc/ide/hd0/model\") and not user.name:root","throttle":"no_actions","actions":[]}
